/* automatically generated by rust-bindgen 0.69.4 */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const FALSE: u32 = 0;
pub const TRUE: u32 = 1;
pub const REVISION_STRING: &[u8; 12] = b"$Rev: 156 $\0";
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 0;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const __STDC_SECURE_LIB__: u32 = 200411;
pub const __GOT_SECURE_LIB__: u32 = 200411;
pub const __STDC_WANT_SECURE_LIB__: u32 = 1;
pub const _SECURECRT_FILL_BUFFER_PATTERN: u32 = 254;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_COUNT: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: u32 = 1;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_MEMORY: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES_MEMORY: u32 = 0;
pub const _MAX_ITOSTR_BASE16_COUNT: u32 = 9;

pub const RAND_MAX: u32 = 32767;
pub const _CVTBUFSIZE: u32 = 349;
pub const _MAX_PATH: u32 = 260;
pub const _MAX_DRIVE: u32 = 3;
pub const _MAX_DIR: u32 = 256;
pub const _MAX_FNAME: u32 = 256;
pub const _MAX_EXT: u32 = 256;
pub const _MAX_ENV: u32 = 32767;
pub const MCD_API_VER_MAJOR: u32 = 1;
pub const MCD_API_VER_MINOR: u32 = 1;
pub const MCD_API_VER_AUTHOR: &[u8; 15] = b"SPRINT Release\0";
pub const MCD_HOSTNAME_LEN: u32 = 64;
pub const MCD_REG_NAME_LEN: u32 = 32;
pub const MCD_MEM_SPACE_NAME_LEN: u32 = 32;
pub const MCD_MEM_BLOCK_NAME_LEN: u32 = 32;
pub const MCD_MEM_BLOCK_NOPARENT: u32 = 0;
pub const MCD_MEM_AUSIZE_NUM: u32 = 8;
pub const MCD_INFO_STR_LEN: u32 = 256;
pub const MCD_KEY_LEN: u32 = 64;
pub const MCD_UNIQUE_NAME_LEN: u32 = 64;
pub const MCD_MAX_TRIGS: u32 = 32;
pub const MCD_API_IMP_VENDOR_LEN: u32 = 32;
pub const MCD_CHL_NUM_MAX: u32 = 32;
pub const MCD_CHL_LOWEST_PRIORITY: u32 = 15;
pub const MCD_TX_NUM_MAX: u32 = 64;
pub const MCD_GUARANTEED_MIN_PAYLOAD: u32 = 16384;
pub const MCD_CORE_MODE_NAME_LEN: u32 = 32;
pub type va_list = *mut ::std::os::raw::c_char;
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type mcd_char_t = ::std::os::raw::c_char;
pub type mcd_bool_t = u32;
pub type __crt_bool = bool;
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_data_public> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_data_public>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_data_public>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_pctype) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(__crt_locale_data_public),
        "::",
        stringify!(_locale_pctype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_mb_cur_max) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(__crt_locale_data_public),
        "::",
        stringify!(_locale_mb_cur_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_lc_codepage) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(__crt_locale_data_public),
        "::",
        stringify!(_locale_lc_codepage)
        )
    );
}
impl Default for __crt_locale_data_public {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_pointers> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_pointers>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_pointers>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locinfo) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(__crt_locale_pointers),
        "::",
        stringify!(locinfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mbcinfo) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(__crt_locale_pointers),
        "::",
        stringify!(mbcinfo)
        )
    );
}
impl Default for __crt_locale_pointers {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
    const UNINIT: ::std::mem::MaybeUninit<_Mbstatet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_Mbstatet>(),
        8usize,
        concat!("Size of: ", stringify!(_Mbstatet))
    );
    assert_eq!(
        ::std::mem::align_of::<_Mbstatet>(),
        4usize,
        concat!("Alignment of ", stringify!(_Mbstatet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Wchar) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(_Mbstatet),
        "::",
        stringify!(_Wchar)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Byte) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(_Mbstatet),
        "::",
        stringify!(_Byte)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._State) as usize - ptr as usize },
        6usize,
        concat!(
        "Offset of field: ",
        stringify!(_Mbstatet),
        "::",
        stringify!(_State)
        )
    );
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
pub type _onexit_t = ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
pub type _purecall_handler = ::std::option::Option<unsafe extern "C" fn()>;
pub type _invalid_parameter_handler = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const wchar_t,
        arg2: *const wchar_t,
        arg3: *const wchar_t,
        arg4: ::std::os::raw::c_uint,
        arg5: usize,
    ),
>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__div_t() {
    const UNINIT: ::std::mem::MaybeUninit<_div_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_div_t>(),
        8usize,
        concat!("Size of: ", stringify!(_div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_div_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(_div_t),
        "::",
        stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(_div_t),
        "::",
        stringify!(rem)
        )
    );
}
pub type div_t = _div_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout__ldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ldiv_t>(),
        8usize,
        concat!("Size of: ", stringify!(_ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ldiv_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(_ldiv_t),
        "::",
        stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(_ldiv_t),
        "::",
        stringify!(rem)
        )
    );
}
pub type ldiv_t = _ldiv_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout__lldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<_lldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(_lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_lldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(_lldiv_t),
        "::",
        stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(_lldiv_t),
        "::",
        stringify!(rem)
        )
    );
}
pub type lldiv_t = _lldiv_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _LDOUBLE {
    pub ld: [::std::os::raw::c_uchar; 10usize],
}
#[test]
fn bindgen_test_layout__LDOUBLE() {
    const UNINIT: ::std::mem::MaybeUninit<_LDOUBLE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_LDOUBLE>(),
        10usize,
        concat!("Size of: ", stringify!(_LDOUBLE))
    );
    assert_eq!(
        ::std::mem::align_of::<_LDOUBLE>(),
        1usize,
        concat!("Alignment of ", stringify!(_LDOUBLE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ld) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(_LDOUBLE),
        "::",
        stringify!(ld)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _CRT_DOUBLE {
    pub x: f64,
}
#[test]
fn bindgen_test_layout__CRT_DOUBLE() {
    const UNINIT: ::std::mem::MaybeUninit<_CRT_DOUBLE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_CRT_DOUBLE>(),
        8usize,
        concat!("Size of: ", stringify!(_CRT_DOUBLE))
    );
    assert_eq!(
        ::std::mem::align_of::<_CRT_DOUBLE>(),
        8usize,
        concat!("Alignment of ", stringify!(_CRT_DOUBLE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(_CRT_DOUBLE),
        "::",
        stringify!(x)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _CRT_FLOAT {
    pub f: f32,
}
#[test]
fn bindgen_test_layout__CRT_FLOAT() {
    const UNINIT: ::std::mem::MaybeUninit<_CRT_FLOAT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_CRT_FLOAT>(),
        4usize,
        concat!("Size of: ", stringify!(_CRT_FLOAT))
    );
    assert_eq!(
        ::std::mem::align_of::<_CRT_FLOAT>(),
        4usize,
        concat!("Alignment of ", stringify!(_CRT_FLOAT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(_CRT_FLOAT),
        "::",
        stringify!(f)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _LONGDOUBLE {
    pub x: f64,
}
#[test]
fn bindgen_test_layout__LONGDOUBLE() {
    const UNINIT: ::std::mem::MaybeUninit<_LONGDOUBLE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_LONGDOUBLE>(),
        8usize,
        concat!("Size of: ", stringify!(_LONGDOUBLE))
    );
    assert_eq!(
        ::std::mem::align_of::<_LONGDOUBLE>(),
        8usize,
        concat!("Alignment of ", stringify!(_LONGDOUBLE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(_LONGDOUBLE),
        "::",
        stringify!(x)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _LDBL12 {
    pub ld12: [::std::os::raw::c_uchar; 12usize],
}
#[test]
fn bindgen_test_layout__LDBL12() {
    const UNINIT: ::std::mem::MaybeUninit<_LDBL12> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_LDBL12>(),
        12usize,
        concat!("Size of: ", stringify!(_LDBL12))
    );
    assert_eq!(
        ::std::mem::align_of::<_LDBL12>(),
        1usize,
        concat!("Alignment of ", stringify!(_LDBL12))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ld12) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(_LDBL12),
        "::",
        stringify!(ld12)
        )
    );
}
/// \brief Enumeration type defining the action a calling function has to take after an MCD API function call.
///
///The calling function has to evaluate the return value of an MCD API function call
///in order to check its success. If the function returned with an error an appropriate
///action has to be taken as defined by the return value.
///All MCD API functions return a value of type \ref mcd_return_et. The calling function
///has to decide the further proceeding based on it.
///
///A few return codes have been reserved for future API use and must not be used. Any
///further value can be used for customized actions. All of these user defined actions
///need to have values between \c MCD_RET_ACT_CUSTOM_LO and \c MCD_RET_ACT_CUSTOM_HI.
pub type mcd_return_et = u32;
///< No special action required.
pub const MCD_RET_ACT_NONE: _bindgen_ty_1 = 0;
///< Try to call the function again.
pub const MCD_RET_ACT_AGAIN: _bindgen_ty_1 = 1;
///< Handle the event or events.
pub const MCD_RET_ACT_HANDLE_EVENT: _bindgen_ty_1 = 2;
///< Handle the error.
pub const MCD_RET_ACT_HANDLE_ERROR: _bindgen_ty_1 = 3;
///< Begin Range: Action reserved for future API use.
pub const MCD_RET_ACT_RESERVED_LO: _bindgen_ty_1 = 4;
///< End   Range: Action reserved for future API use.
pub const MCD_RET_ACT_RESERVED_HI: _bindgen_ty_1 = 32768;
///< Begin Range: For user defined actions.
pub const MCD_RET_ACT_CUSTOM_LO: _bindgen_ty_1 = 65536;
///< End   Range: For user defined actions.
pub const MCD_RET_ACT_CUSTOM_HI: _bindgen_ty_1 = 1073741824;
pub type _bindgen_ty_1 = ::std::os::raw::c_int;
/// \brief Enumeration type defining the detailed error codes that can be returned by an MCD API function call.
///
///The calling function has to evaluate the return value of an MCD API function call
///in order to check its success. If the function returned with an error an appropriate
///action has to be taken as defined by the return value.
///All MCD API functions return a value of type \ref mcd_return_et. If the returned value
///indicates an error, the user has to retrieve the detailed information on the occurred
///error by calling \ref mcd_qry_error_info_f(). The following enumeration is part of this
///information and describes the detailed error codes.
///
///The enumeration's values can be subdivided into the following categories:
///- GENERAL       (0x0000-0x0FFF)         : These errors can be returned by any MCD API function call.
///- API_SPECIFIC  (0x1000-0x10000000)     : These errors are specific to certain MCD API function calls.
///Some of them may be valid for multiple MCD API function calls.
///- CUSTOM        (0x10000000-0x7FFFFFFF) : These error codes can be defined by the user and carry user
///defined semantics.
pub type mcd_error_code_et = u32;
///< No error.
pub const MCD_ERR_NONE: _bindgen_ty_2 = 0;
///< Called function is not implemented.
pub const MCD_ERR_FN_UNIMPLEMENTED: _bindgen_ty_2 = 256;
///< MCD API not correctly used.
pub const MCD_ERR_USAGE: _bindgen_ty_2 = 257;
///< Passed invalid parameter.
pub const MCD_ERR_PARAM: _bindgen_ty_2 = 258;
///< Server connection error.
pub const MCD_ERR_CONNECTION: _bindgen_ty_2 = 512;
///< Function call timed out.
pub const MCD_ERR_TIMED_OUT: _bindgen_ty_2 = 513;
///< General error.
pub const MCD_ERR_GENERAL: _bindgen_ty_2 = 3840;
///< String to return is longer than the provided character array.
pub const MCD_ERR_RESULT_TOO_LONG: _bindgen_ty_2 = 4096;
///< Could not start server.
pub const MCD_ERR_COULD_NOT_START_SERVER: _bindgen_ty_2 = 4352;
///< Server is locked.
pub const MCD_ERR_SERVER_LOCKED: _bindgen_ty_2 = 4353;
///< No memory spaces defined.
pub const MCD_ERR_NO_MEM_SPACES: _bindgen_ty_2 = 5121;
///< No memory blocks defined for the requested memory space.
pub const MCD_ERR_NO_MEM_BLOCKS: _bindgen_ty_2 = 5122;
///< No memory space with requested ID exists.
pub const MCD_ERR_MEM_SPACE_ID: _bindgen_ty_2 = 5136;
///< No register groups defined.
pub const MCD_ERR_NO_REG_GROUPS: _bindgen_ty_2 = 5184;
///< No register group with requested ID exists.
pub const MCD_ERR_REG_GROUP_ID: _bindgen_ty_2 = 5185;
///< Register is not a compound register.
pub const MCD_ERR_REG_NOT_COMPOUND: _bindgen_ty_2 = 5186;
///< Error retrieving overlay information.
pub const MCD_ERR_OVERLAYS: _bindgen_ty_2 = 5376;
///< Cannot access device (power-down, reset active, etc.).
pub const MCD_ERR_DEVICE_ACCESS: _bindgen_ty_2 = 6400;
///< Device is locked.
pub const MCD_ERR_DEVICE_LOCKED: _bindgen_ty_2 = 6401;
///< Read transaction of transaction list has failed.
pub const MCD_ERR_TXLIST_READ: _bindgen_ty_2 = 8448;
///< Write transaction of transaction list has failed.
pub const MCD_ERR_TXLIST_WRITE: _bindgen_ty_2 = 8449;
///< Other error (no R/W failure) for a transaction of the
///transaction list.
pub const MCD_ERR_TXLIST_TX: _bindgen_ty_2 = 8450;
///< Requested channel type is not supported by the implementation.
pub const MCD_ERR_CHL_TYPE_NOT_SUPPORTED: _bindgen_ty_2 = 12544;
///< Addressed target does not support communication channels.
pub const MCD_ERR_CHL_TARGET_NOT_SUPPORTED: _bindgen_ty_2 = 12545;
///< Channel setup is invalid or contains unsupported attributes.
pub const MCD_ERR_CHL_SETUP: _bindgen_ty_2 = 12546;
///< Sending or receiving of the last message has failed.
pub const MCD_ERR_CHL_MESSAGE_FAILED: _bindgen_ty_2 = 12608;
///< Trigger could not be created.
pub const MCD_ERR_TRIG_CREATE: _bindgen_ty_2 = 12800;
///< Error during trigger information access.
pub const MCD_ERR_TRIG_ACCESS: _bindgen_ty_2 = 12801;
///< Begin Range: For user defined errors.
pub const MCD_ERR_CUSTOM_LO: _bindgen_ty_2 = 268435456;
///< End   Range: For user defined errors.
pub const MCD_ERR_CUSTOM_HI: _bindgen_ty_2 = 2147483647;
pub type _bindgen_ty_2 = ::std::os::raw::c_int;
/// \brief Enumeration type defining the error events that can be returned by an MCD API function call.
///
///The calling function has to evaluate the return value of an MCD API function call
///in order to check its success. If the function returned with an error an appropriate
///action has to be taken as defined by the return value.
///All MCD API functions return a value of type mcd_return_et. If the returned value
///indicates an event, the user has to retrieve the detailed information on the occurred
///error by calling \ref mcd_qry_error_info_f(). The following enumeration is part of this
///information and describes the detailed event codes.
///
///Event codes are bitwise exclusive. This allows 32 different event codes. User defined
///event codes need to have values between \c MCD_ERR_EVT_CUSTOM_LO and \c MCD_ERR_EVT_CUSTOM_HI.
///Reserved error event codes must not be used.
pub type mcd_error_event_et = u32;
///< No action required due to an event.
pub const MCD_ERR_EVT_NONE: _bindgen_ty_3 = 0;
///< Target has been reset.
pub const MCD_ERR_EVT_RESET: _bindgen_ty_3 = 1;
///< Target has been a powered down.
pub const MCD_ERR_EVT_PWRDN: _bindgen_ty_3 = 2;
///< There has been a target hardware failure.
pub const MCD_ERR_EVT_HWFAILURE: _bindgen_ty_3 = 4;
///< Begin Range: Events reserved for future API use.
pub const MCD_ERR_EVT_RESERVED_LO: _bindgen_ty_3 = 8;
///< End   Range: Events reserved for future API use.
pub const MCD_ERR_EVT_RESERVED_HI: _bindgen_ty_3 = 32768;
///< Begin Range: User defined events.
pub const MCD_ERR_EVT_CUSTOM_LO: _bindgen_ty_3 = 65536;
///< End   Range: User defined events.
pub const MCD_ERR_EVT_CUSTOM_HI: _bindgen_ty_3 = 1073741824;
pub type _bindgen_ty_3 = ::std::os::raw::c_int;
/// \brief Enumeration type defining the type of an address space ID.
///
///The type of the address space ID defines the interpretation of an address space ID.
///This type refers to the \c addr_space_id member of \c mcd_addr_st which is used to
///further extend the address information.
pub type mcd_addr_space_type_et = u32;
///< Address space ID is not used.
pub const MCD_NOTUSED_ID: _bindgen_ty_4 = 0;
///< Address space ID represents the memory overlay the address is valid in.
pub const MCD_OVERLAY_ID: _bindgen_ty_4 = 1;
///< Address space ID represents the memory bank the address is valid in.
pub const MCD_MEMBANK_ID: _bindgen_ty_4 = 2;
///< Address space ID represents the process the address is valid in.
pub const MCD_PROCESS_ID: _bindgen_ty_4 = 3;
///< Address space ID represents the hardware thread the address is valid in.
pub const MCD_HW_THREAD_ID: _bindgen_ty_4 = 4;
pub type _bindgen_ty_4 = ::std::os::raw::c_int;
/// \brief Enumeration type defining the type of a memory space.
///
///Different types of memory spaces are possible. This enumeration type describes
///them. The type values \c MCD_MEM_SPACE_IS_REGISTERS, \c MCD_MEM_SPACE_IS_PROGRAM,
///\c MCD_MEM_SPACE_IS_VIRTUAL and \c MCD_MEM_SPACE_IS_CACHE are bitwise mutually exclusive.
///\c MCD_MEM_SPACE_IS_PHYSICAL or \c MCD_MEM_SPACE_IS_LOGICAL should be set when the target contains a
///memory memagement unit (MMU) that translates memory addresses between core and memory.
///E.g. use (MCD_MEM_SPACE_IS_PROGRAM|MCD_MEM_SPACE_IS_LOGICAL) to identify an logical addresses of the program memory.
///User defined memory space types need to have values between \c MCD_MEMSPACE_CUSTOM_HI and \c MCD_MEMSPACE_CUSTOM_HI.
///Reserved memory space types must not be used.
pub type mcd_mem_type_et = u32;
///< The memory space is of none of the types below.
pub const MCD_MEM_SPACE_DEFAULT: _bindgen_ty_5 = 0;
///< The memory space contains only registers.
pub const MCD_MEM_SPACE_IS_REGISTERS: _bindgen_ty_5 = 1;
///< The memory space is a program memory.
pub const MCD_MEM_SPACE_IS_PROGRAM: _bindgen_ty_5 = 2;
///< The memory space is virtual (resource not existing in target).
pub const MCD_MEM_SPACE_IS_VIRTUAL: _bindgen_ty_5 = 4;
///< The memory space is a cache.
pub const MCD_MEM_SPACE_IS_CACHE: _bindgen_ty_5 = 8;
///< The memory space is physical memory (not translated by MMU)
pub const MCD_MEM_SPACE_IS_PHYSICAL: _bindgen_ty_5 = 16;
///< The memory space is logical memory (translated by MMU)
pub const MCD_MEM_SPACE_IS_LOGICAL: _bindgen_ty_5 = 32;
///< Begin Range: Reserved for future API use.
pub const MCD_MEM_SPACE_RESERVED_LO: _bindgen_ty_5 = 64;
///< End   Range: Reserved for future API use.
pub const MCD_MEM_SPACE_RESERVED_HI: _bindgen_ty_5 = 32768;
///< Begin Range: User defined memory types.
pub const MCD_MEM_SPACE_CUSTOM_LO: _bindgen_ty_5 = 65536;
///< End   Range: User defined memory types.
pub const MCD_MEM_SPACE_CUSTOM_HI: _bindgen_ty_5 = 1073741824;
pub type _bindgen_ty_5 = ::std::os::raw::c_int;
/// \brief Enumeration type defining the endianness of a memory space or a memory block.
///
///The endianness of a memory can be either Little Endian or Big Endian. This enumeration
///type describes the two possible values of endianness and is used to set the corresponding
///property of a memory space and a memory block description. If memory blocks are
///supported, the value of a memory block overrides the one for the memory space it is
///part of.
pub type mcd_endian_et = u32;
///< Endianness as defined by the target architecture
///or parent module (if available).
pub const MCD_ENDIAN_DEFAULT: _bindgen_ty_6 = 0;
///< Little Endian data representation.
pub const MCD_ENDIAN_LITTLE: _bindgen_ty_6 = 1;
///< Big Endian data representation.
pub const MCD_ENDIAN_BIG: _bindgen_ty_6 = 2;
pub type _bindgen_ty_6 = ::std::os::raw::c_int;
/// \brief Enumeration type defining the allowed register types.
///
///A register can be a simple register, a compound register or a partial register.
///This enumeration type describes the three register types.
pub type mcd_reg_type_et = u32;
///< Simple register.
pub const MCD_REG_TYPE_SIMPLE: _bindgen_ty_7 = 0;
///< Compound register composed more than one simple register.
pub const MCD_REG_TYPE_COMPOUND: _bindgen_ty_7 = 1;
///< Register that is part of a simple register.
pub const MCD_REG_TYPE_PARTIAL: _bindgen_ty_7 = 2;
pub type _bindgen_ty_7 = ::std::os::raw::c_int;
/// \brief Enumeration type defining the type of a trigger.
///
///This enumeration type describes the possible types of triggers for the
///target. The type values are bitwise mutually exclusive and a member of
///type \ref mcd_trig_type_et may be a combination of several of them.
///The type \c MCD_TRIG_TYPE_CUSTOM refers to a custom trigger (not a custom trigger
///type) using the standard format as defined by \ref mcd_trig_custom_st. User defined
///trigger types need to have values between \c MCD_TRIG_TYPE_CUSTOM_LO and
///\c MCD_TRIG_TYPE_CUSTOM_HI.
pub type mcd_trig_type_et = u32;
///< Undefined trigger type.
pub const MCD_TRIG_TYPE_UNDEFINED: _bindgen_ty_8 = 0;
///< Trigger on a changing instruction pointer.
pub const MCD_TRIG_TYPE_IP: _bindgen_ty_8 = 1;
///< Trigger on a read data access to a specific address or address range.
pub const MCD_TRIG_TYPE_READ: _bindgen_ty_8 = 2;
///< Trigger on a write data access to a specific address or address range.
pub const MCD_TRIG_TYPE_WRITE: _bindgen_ty_8 = 4;
///< Trigger on a read or a write data access to a specific address or
///address range.
pub const MCD_TRIG_TYPE_RW: _bindgen_ty_8 = 8;
///< Trigger on core information other than an IP or data compare trigger.
pub const MCD_TRIG_TYPE_NOCYCLE: _bindgen_ty_8 = 16;
///< Trigger on a trigger bus combination.
pub const MCD_TRIG_TYPE_TRIG_BUS: _bindgen_ty_8 = 32;
///< Trigger on an elapsed trigger counter.
pub const MCD_TRIG_TYPE_COUNTER: _bindgen_ty_8 = 64;
///< Custom trigger using standard format as defined by \ref mcd_trig_custom_st.
pub const MCD_TRIG_TYPE_CUSTOM: _bindgen_ty_8 = 128;
///< Begin Range: User defined trigger types.
pub const MCD_TRIG_TYPE_CUSTOM_LO: _bindgen_ty_8 = 65536;
///< End   Range: User defined trigger types.
pub const MCD_TRIG_TYPE_CUSTOM_HI: _bindgen_ty_8 = 1073741824;
pub type _bindgen_ty_8 = ::std::os::raw::c_int;
/// \brief Enumeration type defining additional options for a trigger.
///
///This enumeration type describes the additionally possible options for
///triggers in a target. The type values are bitwise mutually exclusive
///and a member of type \ref mcd_trig_opt_et may be a combination of several
///of them. User defined trigger options need to have values between
///\c MCD_TRIG_OPT_CUSTOM_LO and \c MCD_TRIG_OPT_CUSTOM_HI.
pub type mcd_trig_opt_et = u32;
///< Default trigger options, e.g. chosen by the platform.
pub const MCD_TRIG_OPT_DEFAULT: _bindgen_ty_9 = 0;
///< The trigger shall be implemented by hardware.
pub const MCD_TRIG_OPT_IMPL_HARDWARE: _bindgen_ty_9 = 1;
///< The trigger shall be implemented by software (code substitution).
pub const MCD_TRIG_OPT_IMPL_SOFTWARE: _bindgen_ty_9 = 2;
///< The trigger is activated when a data access is performed outside
///the specified range.
pub const MCD_TRIG_OPT_OUT_OF_RANGE: _bindgen_ty_9 = 4;
///< The value of a data access is part of the trigger condition.
pub const MCD_TRIG_OPT_DATA_IS_CONDITION: _bindgen_ty_9 = 8;
///< The size of a data access is part of the trigger condition.
pub const MCD_TRIG_OPT_DATASIZE_IS_CONDITION: _bindgen_ty_9 = 16;
///< The data comparison done in a trigger condition is negated.
pub const MCD_TRIG_OPT_NOT_DATA: _bindgen_ty_9 = 32;
///< The data values are considered as signed for the trigger
///condition. This usually requires the setting of
///\c MCD_TRIG_OPT_DATASIZE_IS_CONDITION.
pub const MCD_TRIG_OPT_SIGNED_DATA: _bindgen_ty_9 = 64;
///< The hardware thread ID is part of the trigger condition.
pub const MCD_TRIG_OPT_HW_THREAD_IS_CONDITION: _bindgen_ty_9 = 128;
///< The comparison of the hardware thread ID is negated.
pub const MCD_TRIG_OPT_NOT_HW_THREAD: _bindgen_ty_9 = 256;
///< The software thread ID is part of the trigger condition.
pub const MCD_TRIG_OPT_SW_THREAD_IS_CONDITION: _bindgen_ty_9 = 512;
///< The comparison of the software thread ID is negated.
pub const MCD_TRIG_OPT_NOT_SW_THREAD: _bindgen_ty_9 = 1024;
///< The data value of the cycle must change the value of the target location.
///This applies only to triggers on write cycles.
///The \c data_mask field defines which bits are considered for the comparison.
pub const MCD_TRIG_OPT_DATA_MUST_CHANGE: _bindgen_ty_9 = 2048;
///< The core mode as defined by the member \c core_mode_mask of a
///\ref mcd_trig_complex_core_st is part of the trigger condition.
///Each set bit prevents the related core mode from activating
///the trigger.
pub const MCD_TRIG_OPT_CORE_MODE_IS_CONDITION: _bindgen_ty_9 = 131072;
///< The state of the trigger set's state machine is part of the trigger
///condition.
pub const MCD_TRIG_OPT_STATE_IS_CONDITION: _bindgen_ty_9 = 262144;
///< The trigger condition is negated, i.e. action is taken if the
///whole trigger condition is NOT met. This should not be mixed up with
///\c MCD_TRIG_OPT_OUT_OF_RANGE which inverts just the address range.
pub const MCD_TRIG_OPT_NOT: _bindgen_ty_9 = 524288;
///< Begin Range: User defined trigger options.
pub const MCD_TRIG_OPT_CUSTOM_LO: _bindgen_ty_9 = 1048576;
///< End   Range: User defined trigger options.
pub const MCD_TRIG_OPT_CUSTOM_HI: _bindgen_ty_9 = 1073741824;
pub type _bindgen_ty_9 = ::std::os::raw::c_int;
/// \brief Enumeration type defining the trigger action types.
///
///This enumeration type describes the possible actions for triggers
///in a target. The type values are bitwise mutually exclusive and
///a member of type \c mcd_trig_action_et may be a combination of
///several of them. User defined trigger actions need to have values
///between \c MCD_TRIG_ACTION_CUSTOM_LO and \c MCD_TRIG_ACTION_CUSTOM_HI.
pub type mcd_trig_action_et = u32;
///< No action has to be taken except from setting the
///trigger to be captured.
pub const MCD_TRIG_ACTION_DEFAULT: _bindgen_ty_10 = 0;
///< Stop this core and bring it into debug mode.
pub const MCD_TRIG_ACTION_DBG_DEBUG: _bindgen_ty_10 = 1;
///< Stop all cores and bring them into debug mode.
pub const MCD_TRIG_ACTION_DBG_GLOBAL: _bindgen_ty_10 = 2;
///< Issue an exception (monitor interrupt) on this core
///in order to execute the monitor code.
pub const MCD_TRIG_ACTION_DBG_MONITOR: _bindgen_ty_10 = 4;
///< Signal the according event on the trigger bus (for
///the duration of one core cycle). The corresponding
///bitmask is specified by the member \c action_param
///of the used trigger data structure.
pub const MCD_TRIG_ACTION_TRIG_BUS_EVENT: _bindgen_ty_10 = 16;
///< Set bits on the trigger bus. The corresponding bitmask
///is specified by the member \c action_param of the used
///trigger data structure.
pub const MCD_TRIG_ACTION_TRIG_BUS_SET: _bindgen_ty_10 = 32;
///< Clear bits on the trigger bus. The corresponding bitmask
///is specified by the member \c action_param of the used
///trigger data structure.
pub const MCD_TRIG_ACTION_TRIG_BUS_CLEAR: _bindgen_ty_10 = 64;
///< Trace this cycle.
pub const MCD_TRIG_ACTION_TRACE_QUALIFY: _bindgen_ty_10 = 256;
///< Trace this cycle, affects program trace only.
pub const MCD_TRIG_ACTION_TRACE_QUALIFY_PROGRAM: _bindgen_ty_10 = 512;
///< Trace this cycle, affects data trace only.
pub const MCD_TRIG_ACTION_TRACE_QUALIFY_DATA: _bindgen_ty_10 = 1024;
///< Start tracing.
pub const MCD_TRIG_ACTION_TRACE_START: _bindgen_ty_10 = 2048;
///< Stop tracing.
pub const MCD_TRIG_ACTION_TRACE_STOP: _bindgen_ty_10 = 4096;
///< Trigger trace unit.
pub const MCD_TRIG_ACTION_TRACE_TRIGGER: _bindgen_ty_10 = 8192;
///< Start performance analysis or profiling.
pub const MCD_TRIG_ACTION_ANA_START_PERFM: _bindgen_ty_10 = 65536;
///< Stop performance analysis or profiling.
pub const MCD_TRIG_ACTION_ANA_STOP_PERFM: _bindgen_ty_10 = 131072;
///< Set the trigger set's state machine to a new state. The
///corresponding state is specified by the member
///\c action_param of the used trigger data structure.
pub const MCD_TRIG_ACTION_STATE_CHANGE: _bindgen_ty_10 = 262144;
///< Increment the counter specified by the member
///\c action_param of the used trigger data structure.
pub const MCD_TRIG_ACTION_COUNT_QUALIFY: _bindgen_ty_10 = 524288;
///< Start the counter specified by the member \c action_param
///of the used trigger data structure.
pub const MCD_TRIG_ACTION_COUNT_START: _bindgen_ty_10 = 1048576;
///< Stop the counter specified by the member \c action_param
///of the used trigger data structure.
pub const MCD_TRIG_ACTION_COUNT_STOP: _bindgen_ty_10 = 2097152;
///< Restart the counter specified by the member \c action_param
///of the used trigger data structure.
pub const MCD_TRIG_ACTION_COUNT_RESTART: _bindgen_ty_10 = 4194304;
///< Begin Range: User defined trigger actions.
pub const MCD_TRIG_ACTION_CUSTOM_LO: _bindgen_ty_10 = 16777216;
///< End   Range: User defined trigger actions.
pub const MCD_TRIG_ACTION_CUSTOM_HI: _bindgen_ty_10 = 1073741824;
pub type _bindgen_ty_10 = ::std::os::raw::c_int;
/// \brief Enumeration type defining access types for transactions of transaction lists.
///
///This enumeration type describes the four possible access types for transactions
///of a transaction list.
pub type mcd_tx_access_type_et = u32;
///< Read access transaction.
pub const MCD_TX_AT_R: _bindgen_ty_11 = 1;
///< Write access transaction.
pub const MCD_TX_AT_W: _bindgen_ty_11 = 2;
///< Read then write access transaction (atomic swap).
pub const MCD_TX_AT_RW: _bindgen_ty_11 = 3;
///< Write then read access transaction (write and verify).
pub const MCD_TX_AT_WR: _bindgen_ty_11 = 4;
pub type _bindgen_ty_11 = ::std::os::raw::c_int;
/// \brief Enumeration type defining access options for transactions of transaction lists.
///
///This enumeration type describes the possible access options for transactions of a
///transaction list. The type values are bitwise mutually exclusive and a member of
///type \c mcd_tx_access_opt_et may be a combination of several of them. User defined
///access options need to have values between \c MCD_TX_OPT_CUSTOM_LO and
///\c MCD_TX_OPT_CUSTOM_HI. Reserved access options must not be used.
///
///Marking the last transaction of a transaction list with \c MCD_TX_OPT_ATOMIC_WITH_NEXT
///causes it to be atomic with the first transaction of the next list to be executed
///for this core connection.
pub type mcd_tx_access_opt_et = u32;
///< MCD implementation decides on applied access options.
pub const MCD_TX_OPT_DEFAULT: _bindgen_ty_12 = 0;
///< Trigger side effects for the access.
pub const MCD_TX_OPT_SIDE_EFFECTS: _bindgen_ty_12 = 1;
///< Omit side effects for the access.
pub const MCD_TX_OPT_NO_SIDE_EFFECTS: _bindgen_ty_12 = 2;
///< Perform burst accesses if possible.
pub const MCD_TX_OPT_BURST_ACCESSES: _bindgen_ty_12 = 4;
///< Avoid burst accesses if possible.
pub const MCD_TX_OPT_NO_BURST_ACCESSES: _bindgen_ty_12 = 8;
///< Dual port or DAP memory access.
pub const MCD_TX_OPT_ALTERNATE_PATH: _bindgen_ty_12 = 16;
///< High priority access.
pub const MCD_TX_OPT_PRIORITY_ACCESS: _bindgen_ty_12 = 32;
///< Force D-cache and unified caches to be write-through.
pub const MCD_TX_OPT_DCACHE_WRITE_THRU: _bindgen_ty_12 = 64;
///< Bypass caches and read/write directly to the memory.
pub const MCD_TX_OPT_CACHE_BYPASS: _bindgen_ty_12 = 128;
///< Do not increment address after each cycle. Useful for
///reading or writing to FIFOs.
pub const MCD_TX_OPT_NOINCREMENT: _bindgen_ty_12 = 256;
///< Transaction is executed atomic with the next one.
pub const MCD_TX_OPT_ATOMIC_WITH_NEXT: _bindgen_ty_12 = 512;
///< Memory is accessed in user mode (instead of
///supervisor mode) Only set this bit in mcd_memblock_st
///or mcd_memspace_st, if the memory can be accessed in
///both supervisor and user mode.
pub const MCD_TX_OPT_USERMODE: _bindgen_ty_12 = 1024;
///< Begin Range: Reserved for future API use.
pub const MCD_TX_OPT_RESERVED_LO: _bindgen_ty_12 = 2048;
///< End   Range: Reserved for future API use.
pub const MCD_TX_OPT_RESERVED_HI: _bindgen_ty_12 = 32768;
///< Begin Range: User defined access options.
pub const MCD_TX_OPT_CUSTOM_LO: _bindgen_ty_12 = 65536;
///< End   Range: User defined access options.
pub const MCD_TX_OPT_CUSTOM_HI: _bindgen_ty_12 = 1073741824;
pub type _bindgen_ty_12 = ::std::os::raw::c_int;
/// \brief Enumeration type defining step types for a target core.
///
///This enumeration type describes the possible step types for a target core. The
///step type depends on the core type. A programmable core can be for example
///stepped in terms of cycles or instructions.
///User defined step types need to have values between \c MCD_CORE_STEP_TYPE_CUSTOM_LO
///and \c MCD_CORE_STEP_TYPE_CUSTOM_HI. They for example can be based on specifications
///provided by the IP developer of a core.
///The step type values \c MCD_CORE_STEP_TYPE_RESERVED_LO to \c MCD_CORE_STEP_TYPE_RESERVED_HI
///are reserved for future API extensions and must not be used.
pub type mcd_core_step_type_et = u32;
///< Step the core for core specific cycles.
pub const MCD_CORE_STEP_TYPE_CYCLES: _bindgen_ty_13 = 1;
///< Step the core for core specific instructions.
pub const MCD_CORE_STEP_TYPE_INSTR: _bindgen_ty_13 = 2;
///< Begin Range: Reserved for future API use.
pub const MCD_CORE_STEP_TYPE_RESERVED_LO: _bindgen_ty_13 = 4;
///< End   Range: Reserved for future API use.
pub const MCD_CORE_STEP_TYPE_RESERVED_HI: _bindgen_ty_13 = 255;
///< Begin Range: User defined step types.
pub const MCD_CORE_STEP_TYPE_CUSTOM_LO: _bindgen_ty_13 = 256;
///< End   Range: User defined step types.
pub const MCD_CORE_STEP_TYPE_CUSTOM_HI: _bindgen_ty_13 = 3840;
///< Maximum number of supported step types.
pub const MCD_CORE_STEP_TYPE_MAX_TYPES: _bindgen_ty_13 = 2147483647;
pub type _bindgen_ty_13 = ::std::os::raw::c_int;
/// \brief Enumeration type defining the execution states of a target core.
///
///This enumeration type describes the possible execution states of a target core from
///a debugger perspective. The HALTED state is defined to differ from the DEBUG state
///by the fact that a core in debug mode is under debugger control. In contrast to this
///a core in HALTED state is not under the execution control of the debugger but in a
///state from which the debugger can only push it to DEBUG state. The same applies to
///the RUNNING state.
///User defined core states need to have values between \c MCD_CORE_STATE_CUSTOM_LO
///and \c MCD_CORE_STATE_CUSTOM_HI.
pub type mcd_core_state_et = u32;
///< Target core state is unknown.
pub const MCD_CORE_STATE_UNKNOWN: _bindgen_ty_14 = 0;
///< Target core is running.
pub const MCD_CORE_STATE_RUNNING: _bindgen_ty_14 = 1;
///< Target core is halted.
pub const MCD_CORE_STATE_HALTED: _bindgen_ty_14 = 2;
///< Target core is in debug mode.
pub const MCD_CORE_STATE_DEBUG: _bindgen_ty_14 = 3;
///< Begin Range: User defined core states.
pub const MCD_CORE_STATE_CUSTOM_LO: _bindgen_ty_14 = 256;
///< End   Range: User defined core states.
pub const MCD_CORE_STATE_CUSTOM_HI: _bindgen_ty_14 = 2048;
///< Maximum number of supported core states.
pub const MCD_CORE_STATE_MAX_STATES: _bindgen_ty_14 = 2147483647;
pub type _bindgen_ty_14 = ::std::os::raw::c_int;
/// \brief Enumeration type defining the possible events for a target core.
///
///This enumeration type describes the possible core events for a target core
///from a debugger perspective. These allow to optimize the polling of specific
///target information and to support multiple clients connected to one target
///core. Some core events may be reported just once.
///User defined core events need to have values between \c MCD_CORE_EVENT_CUSTOM_LO
///and \c MCD_CORE_EVENT_CUSTOM_HI.
pub type mcd_core_event_et = u32;
///< No since the last poll.
pub const MCD_CORE_EVENT_NONE: _bindgen_ty_15 = 0;
///< Memory content has changed.
pub const MCD_CORE_EVENT_MEMORY_CHANGE: _bindgen_ty_15 = 1;
///< Register contents have changed.
pub const MCD_CORE_EVENT_REGISTER_CHANGE: _bindgen_ty_15 = 2;
///< Trace contents or states have changed.
pub const MCD_CORE_EVENT_TRACE_CHANGE: _bindgen_ty_15 = 4;
///< Triggers or trigger states have changed.
pub const MCD_CORE_EVENT_TRIGGER_CHANGE: _bindgen_ty_15 = 8;
///< Target was stopped at least once since the last poll,
///it may already be running again.
pub const MCD_CORE_EVENT_STOPPED: _bindgen_ty_15 = 16;
///< A target communication channel request from the target
///is pending.
pub const MCD_CORE_EVENT_CHL_PENDING: _bindgen_ty_15 = 32;
///< Begin Range: User defined core events.
pub const MCD_CORE_EVENT_CUSTOM_LO: _bindgen_ty_15 = 65536;
///< End   Range: User defined core events.
pub const MCD_CORE_EVENT_CUSTOM_HI: _bindgen_ty_15 = 1073741824;
pub type _bindgen_ty_15 = ::std::os::raw::c_int;
/// \brief Enumeration type defining the communication channel types.
///
///There can be different types of communication channels between a host side
///tool and the target. This enumeration desribes these possible types of
///communication channels. User defined communication channel types need to
///have values between \c MCD_CHL_TYPE_CUSTOM_LO and \c MCD_CHL_TYPE_CUSTOM_HI.
pub type mcd_chl_type_et = u32;
///<Common communication channel to the target.
pub const MCD_CHL_TYPE_COMMON: _bindgen_ty_16 = 1;
///<Communication channel for configuration purposes,
///e.g. to configure the analysis setup.
pub const MCD_CHL_TYPE_CONFIG: _bindgen_ty_16 = 2;
///<Communication channel to an application running
///on the target, e.g. for semi-hosting purposes.
pub const MCD_CHL_TYPE_APPLI: _bindgen_ty_16 = 3;
///<Begin Range: User defined communication channel types.
pub const MCD_CHL_TYPE_CUSTOM_LO: _bindgen_ty_16 = 256;
///<End   Range: User defined communication channel types.
pub const MCD_CHL_TYPE_CUSTOM_HI: _bindgen_ty_16 = 3840;
pub type _bindgen_ty_16 = ::std::os::raw::c_int;
/// \brief Enumeration type defining communication channel attributes.
///
///A communication channel can be defined with several attributes concerning
///the channel's direction, accessibility and priority. This enumeration
///type describes them. The type values are bitwise mutually exclusive and
///a member of type \ref mcd_chl_attributes_et may be a combination of several
///of them.
pub type mcd_chl_attributes_et = u32;
///< Receive channel.
pub const MCD_CHL_AT_RCV: _bindgen_ty_17 = 1;
///< Send channel.
pub const MCD_CHL_AT_SND: _bindgen_ty_17 = 2;
///< Channel is memory mapped.
pub const MCD_CHL_AT_MEM_MAPPED: _bindgen_ty_17 = 64;
///< Channel has a defined priority.
pub const MCD_CHL_AT_HAS_PRIO: _bindgen_ty_17 = 2048;
pub type _bindgen_ty_17 = ::std::os::raw::c_int;
/// \brief Enumeration type defining basic trace types.
///
///This enumeration type describes the type of a trace source. The
///type values are bitwise mutually exclusive. User defined trace
///types need to have values between \c MCD_TRACE_TYPE_CUSTOM_LO
///and \c MCD_TRACE_TYPE_CUSTOM_HI.
pub type mcd_trace_type_et = u32;
///< Unknown trace source.
pub const MCD_TRACE_TYPE_UNKNOWN: _bindgen_ty_18 = 0;
///< Traces the instruction and (optional)
///data trace stream as seen from the core.
pub const MCD_TRACE_TYPE_CORE: _bindgen_ty_18 = 1;
///< Traces a bus that is not related to the
///program flow.
pub const MCD_TRACE_TYPE_BUS: _bindgen_ty_18 = 2;
///< Traces logical signals (can include buses)
///that have an asynchronous nature.
pub const MCD_TRACE_TYPE_EVENT: _bindgen_ty_18 = 4;
///< Traces statistical or profiling information.
pub const MCD_TRACE_TYPE_STAT: _bindgen_ty_18 = 8;
///< Begin Range: User defined trace types.
pub const MCD_TRACE_TYPE_CUSTOM_LO: _bindgen_ty_18 = 256;
///< End   Range: User defined trace types.
pub const MCD_TRACE_TYPE_CUSTOM_HI: _bindgen_ty_18 = 1073741824;
pub type _bindgen_ty_18 = ::std::os::raw::c_int;
/// \brief Enumeration type defining trace data formats.
///
///This enumeration type describes the format of the trace data. Each
///trace source can deliver data in exactly one format, only. Standard
///formats should be used whenever possible. User defined trace types
///need to have values between \c MCD_TRACE_FORMAT_CUSTOM_LO and
///\c MCD_TRACE_FORMAT_CUSTOM_HI.
pub type mcd_trace_format_et = u32;
///< Trace data format not readable via API.
pub const MCD_TRACE_FORMAT_UNKNOWN: _bindgen_ty_19 = 0;
///< Execution trace extracted from bus fetch cycles
///(use struct \ref mcd_trace_data_core_st for this format).
pub const MCD_TRACE_FORMAT_CORE_FETCH: _bindgen_ty_19 = 1;
///< Execution trace
///(use struct \ref mcd_trace_data_core_st for this format).
pub const MCD_TRACE_FORMAT_CORE_EXECUTE: _bindgen_ty_19 = 2;
///< Flowtrace data format similar to NEXUS traces, instruction count
///(use struct \ref mcd_trace_data_core_st for this format).
pub const MCD_TRACE_FORMAT_CORE_FLOW_ICOUNT: _bindgen_ty_19 = 3;
///< Flowtrace data format similar to NEXUS traces, bytes count
///(use struct \ref mcd_trace_data_core_st for this format).
pub const MCD_TRACE_FORMAT_CORE_FLOW_BCOUNT: _bindgen_ty_19 = 4;
///< Flowtrace data format with predicates and instruction count
///(use struct \ref mcd_trace_data_core_st for this format).
pub const MCD_TRACE_FORMAT_CORE_FLOW_IPREDICATE: _bindgen_ty_19 = 5;
///< Logic and system event trace
///(use struct \ref mcd_trace_data_event_st for this format).
pub const MCD_TRACE_FORMAT_EVENT: _bindgen_ty_19 = 16;
///< Statistics trace
///(use struct \ref mcd_trace_data_stat_st for this format).
pub const MCD_TRACE_FORMAT_STAT: _bindgen_ty_19 = 32;
///< Begin Range: User defined trace data formats.
pub const MCD_TRACE_FORMAT_CUSTOM_LO: _bindgen_ty_19 = 256;
///< End   Range: User defined trace data formats.
pub const MCD_TRACE_FORMAT_CUSTOM_HI: _bindgen_ty_19 = 2147483647;
pub type _bindgen_ty_19 = ::std::os::raw::c_int;
/// \brief Enumeration type defining operation modes of a trace buffer.
///
///This enumeration type describes the possible operation modes of a
///trace buffer. The type values are bitwise mutually exclusive. User
///defined operation modes need to have values between
///\c MCD_TRACE_MODE_CUSTOM_LO and \c MCD_TRACE_MODE_CUSTOM_HI.
pub type mcd_trace_mode_et = u32;
///< Do not change trace buffer mode.
pub const MCD_TRACE_MODE_NOCHANGE: _bindgen_ty_20 = 0;
///< Circular trace buffer.
pub const MCD_TRACE_MODE_FIFO: _bindgen_ty_20 = 1;
///< Trace stops when buffer is full.
pub const MCD_TRACE_MODE_STACK: _bindgen_ty_20 = 2;
///< Target is stopped (brought into debug state)
///when buffer is almost full.
pub const MCD_TRACE_MODE_LEACH: _bindgen_ty_20 = 4;
///< Trace data are continuously streamed through
///API, buffer is a FIFO for temporary storage.
pub const MCD_TRACE_MODE_PIPE: _bindgen_ty_20 = 8;
///< Begin Range: User defined operation modes.
pub const MCD_TRACE_MODE_CUSTOM_LO: _bindgen_ty_20 = 256;
///< End   Range: User defined operation modes.
pub const MCD_TRACE_MODE_CUSTOM_HI: _bindgen_ty_20 = 1073741824;
pub type _bindgen_ty_20 = ::std::os::raw::c_int;
/// \brief Enumeration type defining trace states.
///
///This enumeration type describes the possible states of a trace.
///User defined trace states need to have values between
///\c MCD_TRACE_STATE_CUSTOM_LO and \c MCD_TRACE_STATE_CUSTOM_HI.
pub type mcd_trace_state_et = u32;
///< Do not change state (only for \ref mcd_set_trace_state_f()).
pub const MCD_TRACE_STATE_NOCHANGE: _bindgen_ty_21 = 0;
///< Trace is disabled and no resources are allocated.
pub const MCD_TRACE_STATE_DISABLE: _bindgen_ty_21 = 1;
///< Trace is off and does not trace data, but is ready for tracing.
pub const MCD_TRACE_STATE_OFF: _bindgen_ty_21 = 2;
///< Trace is armed.
pub const MCD_TRACE_STATE_ARM: _bindgen_ty_21 = 3;
///< Trace is triggered and waits for the post trigger delay.
pub const MCD_TRACE_STATE_TRIGGER: _bindgen_ty_21 = 4;
///< Trace has stopped (after trigger and post trigger delay have elapsed).
pub const MCD_TRACE_STATE_STOP: _bindgen_ty_21 = 5;
///< Clears trace buffer and goes into OFF state (only for \ref mcd_set_trace_state_f()).
pub const MCD_TRACE_STATE_INIT: _bindgen_ty_21 = 16;
///< Begin Range: User defined trace states.
pub const MCD_TRACE_STATE_CUSTOM_LO: _bindgen_ty_21 = 256;
///< End   Range: User defined trace states.
pub const MCD_TRACE_STATE_CUSTOM_HI: _bindgen_ty_21 = 2147483647;
pub type _bindgen_ty_21 = ::std::os::raw::c_int;
/// \brief Enumeration type defining trace markers.
///
///This enumeration type describes markers associated with a single
///trace frame. The type values are bitwise mutually exclusive and
///a member of type \ref mcd_trace_marker_et may be a combination of
///several of them. User defined trace markers need to have values
///between \c MCD_TRACE_MARKER_CUSTOM_LO and \c MCD_TRACE_MARKER_CUSTOM_HI.
pub type mcd_trace_marker_et = u32;
///< No marker set.
pub const MCD_TRACE_MARKER_NONE: _bindgen_ty_22 = 0;
///< Core has started execution in this trace frame (first cycle).
pub const MCD_TRACE_MARKER_RUN: _bindgen_ty_22 = 1;
///< Core has stopped execution in this trace frame (last cycle).
pub const MCD_TRACE_MARKER_DEBUG: _bindgen_ty_22 = 2;
///< Tracing has started in this trace frame (controlled by trigger).
pub const MCD_TRACE_MARKER_START: _bindgen_ty_22 = 4;
///< Tracing has stopped in this trace frame (controlled by trigger).
pub const MCD_TRACE_MARKER_STOP: _bindgen_ty_22 = 8;
///< Error marker (hardware failure or program flow reconstruction error).
pub const MCD_TRACE_MARKER_ERROR: _bindgen_ty_22 = 16;
///< Gap in trace (caused by bandwidth limitation on trace port).
pub const MCD_TRACE_MARKER_GAP: _bindgen_ty_22 = 32;
///< Begin Range: User defined trace markers.
pub const MCD_TRACE_MARKER_CUSTOM_LO: _bindgen_ty_22 = 256;
///< End   Range: User defined trace markers.
pub const MCD_TRACE_MARKER_CUSTOM_HI: _bindgen_ty_22 = 1073741824;
pub type _bindgen_ty_22 = ::std::os::raw::c_int;
/// \brief Enumeration type defining basic trace cycles.
///
///This enumeration type describes the basic trace cycle types for bus
///and core traces. User defined trace cycle types need to have values
///between \c MCD_TRACE_CYCLE_CUSTOM_LO and \c MCD_TRACE_CYCLE_CUSTOM_HI.
pub type mcd_trace_cycle_et = u32;
///< Trave cycle contains no valid data for this core.
pub const MCD_TRACE_CYCLE_UNKNOWN: _bindgen_ty_23 = 0;
///< No trace cycle, control information (marker, timestamp) is valid.
pub const MCD_TRACE_CYCLE_NONE: _bindgen_ty_23 = 1;
///< Program execution cycle, marks the execution of one instruction.
///For a program flow trace this marks the execution of a block
///which is ended with a taken branch.
pub const MCD_TRACE_CYCLE_EXECUTE: _bindgen_ty_23 = 2;
///< Program execution cycle, marks the execution of one conditional
///instruction with a "failing" condition code. For a program flow
///trace this marks the execution of a block which is ended without
///a branch.
pub const MCD_TRACE_CYCLE_NOTEXECUTE: _bindgen_ty_23 = 3;
///< Program fetch cycle, the instruction related to the cycle may
///just be prefetched.
pub const MCD_TRACE_CYCLE_FETCH: _bindgen_ty_23 = 4;
///< Data read cycle.
pub const MCD_TRACE_CYCLE_READ: _bindgen_ty_23 = 5;
///< Data write cycle.
pub const MCD_TRACE_CYCLE_WRITE: _bindgen_ty_23 = 6;
///< Ownership change cycle, usually indicates a change of the executed
///software thread.
pub const MCD_TRACE_CYCLE_OWNERSHIP: _bindgen_ty_23 = 7;
///< Begin Range: User defined trace cycles.
pub const MCD_TRACE_CYCLE_CUSTOM_LO: _bindgen_ty_23 = 256;
///< End   Range: User defined trace cycles.
pub const MCD_TRACE_CYCLE_CUSTOM_HI: _bindgen_ty_23 = 2147483647;
pub type _bindgen_ty_23 = ::std::os::raw::c_int;
/// \brief Structure type containing the MCD API version information of the tool.
///
///This structure type contains version information about the MCD API implementation
///of the tool.
///Reference version at end of SPRINT project is:
///-  v_api_major = 1
///-  v_api_minor = 0
///-  author = "SPRINT Release"
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_api_version_st {
    ///< API major version.
    pub v_api_major: u16,
    ///< API minor version.
    pub v_api_minor: u16,
    ///< API name of the author of this MCD API version
    pub author: [mcd_char_t; 32usize],
}
#[test]
fn bindgen_test_layout_mcd_api_version_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_api_version_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_api_version_st>(),
        36usize,
        concat!("Size of: ", stringify!(mcd_api_version_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_api_version_st>(),
        2usize,
        concat!("Alignment of ", stringify!(mcd_api_version_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v_api_major) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_api_version_st),
        "::",
        stringify!(v_api_major)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v_api_minor) as usize - ptr as usize },
        2usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_api_version_st),
        "::",
        stringify!(v_api_minor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).author) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_api_version_st),
        "::",
        stringify!(author)
        )
    );
}
/// \brief Structure type containing the MCD API implementation information.
///
///This structure type contains important information about the particular implementation
///of the MCD API.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_impl_version_info_st {
    ///< Implemented API version.
    pub v_api: mcd_api_version_st,
    ///< Major version number of this implementation.
    pub v_imp_major: u16,
    ///< Minor version number of this implementation.
    pub v_imp_minor: u16,
    ///< Build number of this implementation.
    pub v_imp_build: u16,
    ///< Name of vendor of the implementation.
    pub vendor: [mcd_char_t; 32usize],
    ///< String from __DATE__ macro at compile time.
    pub date: [mcd_char_t; 16usize],
}
#[test]
fn bindgen_test_layout_mcd_impl_version_info_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_impl_version_info_st> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_impl_version_info_st>(),
        90usize,
        concat!("Size of: ", stringify!(mcd_impl_version_info_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_impl_version_info_st>(),
        2usize,
        concat!("Alignment of ", stringify!(mcd_impl_version_info_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v_api) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_impl_version_info_st),
        "::",
        stringify!(v_api)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v_imp_major) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_impl_version_info_st),
        "::",
        stringify!(v_imp_major)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v_imp_minor) as usize - ptr as usize },
        38usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_impl_version_info_st),
        "::",
        stringify!(v_imp_minor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v_imp_build) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_impl_version_info_st),
        "::",
        stringify!(v_imp_build)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vendor) as usize - ptr as usize },
        42usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_impl_version_info_st),
        "::",
        stringify!(vendor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).date) as usize - ptr as usize },
        74usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_impl_version_info_st),
        "::",
        stringify!(date)
        )
    );
}
/// \brief Structure type containing the error status and error event notification.
///
///All API functions return a value of type \c mcd_return_et. If this value indicates an error or an
///error event that has happened during the last API call, the calling function has to handle it
///appropriately. This can be achieved by asking for more information about the occurred error or error
///event. This structure type contains all the required details about the error and/or the error event
///as reported by the target.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mcd_error_info_st {
    ///< Return status from the last API call.
    pub return_status: mcd_return_et,
    ///< Detailed error code from the last API call.
    pub error_code: mcd_error_code_et,
    ///< Detailed event code from the last API call.
    pub error_events: mcd_error_event_et,
    ///< Detailed error text string from the last API call.
    pub error_str: [mcd_char_t; 256usize],
}
#[test]
fn bindgen_test_layout_mcd_error_info_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_error_info_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_error_info_st>(),
        268usize,
        concat!("Size of: ", stringify!(mcd_error_info_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_error_info_st>(),
        4usize,
        concat!("Alignment of ", stringify!(mcd_error_info_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).return_status) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_error_info_st),
        "::",
        stringify!(return_status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).error_code) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_error_info_st),
        "::",
        stringify!(error_code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).error_events) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_error_info_st),
        "::",
        stringify!(error_events)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).error_str) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_error_info_st),
        "::",
        stringify!(error_str)
        )
    );
}
impl Default for mcd_error_info_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/// \brief Structure type containing the server information.
///
///This structure type contains the information about a running or an installed server.
///
///\c server contains a string with the server name. For a running simulation server, \c system_instance has
///the same value as \c system_instance in \ref mcd_core_con_info_st, and \c acc_hw contains an empty string.
///For a real hardware server it is the other way around.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mcd_server_info_st {
    ///< String containing the server name.
    pub server: [mcd_char_t; 64usize],
    ///< String containing the unique system instance identifier.
    pub system_instance: [mcd_char_t; 64usize],
    ///< String containing the unique device access hardware name.
    pub acc_hw: [mcd_char_t; 64usize],
}
#[test]
fn bindgen_test_layout_mcd_server_info_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_server_info_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_server_info_st>(),
        192usize,
        concat!("Size of: ", stringify!(mcd_server_info_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_server_info_st>(),
        1usize,
        concat!("Alignment of ", stringify!(mcd_server_info_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).server) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_server_info_st),
        "::",
        stringify!(server)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).system_instance) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_server_info_st),
        "::",
        stringify!(system_instance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acc_hw) as usize - ptr as usize },
        128usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_server_info_st),
        "::",
        stringify!(acc_hw)
        )
    );
}
impl Default for mcd_server_info_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/// \brief Structure type containing the server connection instance.
///
///This structure type contains a server connection instance.
///
///For the MCD API a server provides the capability to connect to a system, its devices and/or cores.
///A server can arrange connections to several systems. A system again consists of devices and cores,
///where devices may subsume several cores, e.g. a SoC on a real hardware board. Consequently, a
///multi-core simulation is a system with several processor cores.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mcd_server_st {
    ///< Server connection instance of an implementation at lower level.
    pub instance: *mut ::std::os::raw::c_void,
    ///< String containing the host name.
    pub host: *const mcd_char_t,
    ///< Server configuration information.
    pub config_string: *const mcd_char_t,
}
#[test]
fn bindgen_test_layout_mcd_server_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_server_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_server_st>(),
        24usize,
        concat!("Size of: ", stringify!(mcd_server_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_server_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_server_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).instance) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_server_st),
        "::",
        stringify!(instance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_server_st),
        "::",
        stringify!(host)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config_string) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_server_st),
        "::",
        stringify!(config_string)
        )
    );
}
impl Default for mcd_server_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/// \brief Structure type containing the core connection information.
///
///The MCD hierarchy's top-level is a system. The next level are devices and followed by cores at the
///lowest level are cores. The MCD API is core centric, i.e. connections are established to specific
///cores and not to a device or a system. The core connection information is used to open this connection
///with \ref mcd_open_core_f().
///In order to establish a core connection, the core connection information does not have to complete
///but it has to be unambiguous. A set of hierarchical query functions, starting at system level, allows
///to parse each system top down.
///It is recommended to exclude unnecessary and redundant hierarchy information from \c core and \c device.
///\c device needs to be readable and unambigious within a \c system. \c core again has to be readable and
///unambigious within its superior \c device instance.
///
///This structure type contains all information required to establish a core connection.
///
///A detailed description for a few member fields of \ref mcd_core_con_info_st is provided below:
///- \c system          : String containing the system name. Predefined value is "Real HW" for physical
///devices. Note that in case of "Real HW" the \c acc_hw always needs to be defined.
///- \c system_instance : Allows to differentiate between several system instances with the same name. A
///typical use case is a simulator where different instances can be distinguished
///by their process ID. (For example \c system_instance could be: "Process ID: 1234".
///- \c device          : String containing the system unique device instance name. For Real HW this is
///usually the sales name of the device. If the access hardware operates a multi device
///target system (e.g. over IEEE1149.7), this device string can contain an index to
///differentiate between several devices of the same type.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mcd_core_con_info_st {
    ///< String containing the IP host name.
    pub host: [mcd_char_t; 64usize],
    ///< Port number of the server.
    pub server_port: u32,
    ///< String containing the server key as provided by \ref mcd_open_server_f().
    pub server_key: [mcd_char_t; 64usize],
    ///< String containing the system key as provided by \ref mcd_open_server_f().
    pub system_key: [mcd_char_t; 64usize],
    ///< String containing the device key, optional for \ref mcd_open_core_f().
    pub device_key: [mcd_char_t; 64usize],
    ///< String containing the system name.
    pub system: [mcd_char_t; 64usize],
    ///< String containing the unique system instance identifier.
    pub system_instance: [mcd_char_t; 64usize],
    ///< String containing the unique device access hardware name.
    pub acc_hw: [mcd_char_t; 64usize],
    ///< Device type identifier (IEEE 1149.1 device ID).
    pub device_type: u32,
    ///< String containing the system unique device instance name.
    pub device: [mcd_char_t; 64usize],
    ///< Unique device ID.
    pub device_id: u32,
    ///< String containing the device unique core name.
    pub core: [mcd_char_t; 64usize],
    ///< Core type identifier (taken from ELF predefined architecture).
    pub core_type: u32,
    ///< Unique core ID representing the core version.
    pub core_id: u32,
}
#[test]
fn bindgen_test_layout_mcd_core_con_info_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_core_con_info_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_core_con_info_st>(),
        596usize,
        concat!("Size of: ", stringify!(mcd_core_con_info_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_core_con_info_st>(),
        4usize,
        concat!("Alignment of ", stringify!(mcd_core_con_info_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_con_info_st),
        "::",
        stringify!(host)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).server_port) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_con_info_st),
        "::",
        stringify!(server_port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).server_key) as usize - ptr as usize },
        68usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_con_info_st),
        "::",
        stringify!(server_key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).system_key) as usize - ptr as usize },
        132usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_con_info_st),
        "::",
        stringify!(system_key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device_key) as usize - ptr as usize },
        196usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_con_info_st),
        "::",
        stringify!(device_key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).system) as usize - ptr as usize },
        260usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_con_info_st),
        "::",
        stringify!(system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).system_instance) as usize - ptr as usize },
        324usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_con_info_st),
        "::",
        stringify!(system_instance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acc_hw) as usize - ptr as usize },
        388usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_con_info_st),
        "::",
        stringify!(acc_hw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device_type) as usize - ptr as usize },
        452usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_con_info_st),
        "::",
        stringify!(device_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device) as usize - ptr as usize },
        456usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_con_info_st),
        "::",
        stringify!(device)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device_id) as usize - ptr as usize },
        520usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_con_info_st),
        "::",
        stringify!(device_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core) as usize - ptr as usize },
        524usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_con_info_st),
        "::",
        stringify!(core)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core_type) as usize - ptr as usize },
        588usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_con_info_st),
        "::",
        stringify!(core_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core_id) as usize - ptr as usize },
        592usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_con_info_st),
        "::",
        stringify!(core_id)
        )
    );
}
impl Default for mcd_core_con_info_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/// \brief Structure type containing the core connection instance.
///
///This structure type contains a core connection instance.
///
///A detailed description for a few member fields of \ref mcd_core_st is provided below:
///- \c instance : The core connection instance of an implementation at a lower level.
///This void pointer must not be null except from function calls
///concerning communication channels. For these calls, null pointers
///are allowed in order to address hierarchical levels higher than core
///level.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mcd_core_st {
    ///< Core connection instance of an implementation at lower level.
    pub instance: *mut ::std::os::raw::c_void,
    ///< Core connection information of the core instance.
    pub core_con_info: *const mcd_core_con_info_st,
}
#[test]
fn bindgen_test_layout_mcd_core_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_core_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_core_st>(),
        16usize,
        concat!("Size of: ", stringify!(mcd_core_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_core_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_core_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).instance) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_st),
        "::",
        stringify!(instance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core_con_info) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_st),
        "::",
        stringify!(core_con_info)
        )
    );
}
impl Default for mcd_core_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/// \brief Structure type containing information about a core mode.
///
///This structure type contains information about a specific core mode. Most cores have for example "supervisor"
///or "user" operation modes. \c core_mode can be a value within the range of 1 to 32. Some API structures
///contain bitmasks of which each bit corresponds to \c core_mode of exactly one core mode (bit 0 corresponds
///to core mode 1).
///Core mode 0 is used to define a default core mode - usually the most permissive core mode.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_core_mode_info_st {
    ///< Contains one of the 32 possible core modes,
    ///values can be 1 to 32.
    pub core_mode: u8,
    ///< The name of this core mode.
    pub name: [mcd_char_t; 32usize],
}
#[test]
fn bindgen_test_layout_mcd_core_mode_info_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_core_mode_info_st> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_core_mode_info_st>(),
        33usize,
        concat!("Size of: ", stringify!(mcd_core_mode_info_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_core_mode_info_st>(),
        1usize,
        concat!("Alignment of ", stringify!(mcd_core_mode_info_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core_mode) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_mode_info_st),
        "::",
        stringify!(core_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        1usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_mode_info_st),
        "::",
        stringify!(name)
        )
    );
}
/// \brief Structure type containing a completely resolved logical or physical memory address.
///
///This structure type contains a completely resolved logical or physical memory address. The \c address
///is always expressed in bytes, even if the minimum access unit (MAU) size is larger than a byte. The
///\c addr_space_id can be used for different purposes as defined by \c addr_space_type.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_addr_st {
    ///< Address value within a memory space, expressed in bytes.
    pub address: u64,
    ///< ID of the memory space associated with this address,
    ///e.g. a program memory, a data memory or registers .
    pub mem_space_id: u32,
    ///< ID of the address space in which this address is valid.
    pub addr_space_id: u32,
    ///< Type of the address space in which this address is valid.
    pub addr_space_type: mcd_addr_space_type_et,
}
#[test]
fn bindgen_test_layout_mcd_addr_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_addr_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_addr_st>(),
        24usize,
        concat!("Size of: ", stringify!(mcd_addr_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_addr_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_addr_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_addr_st),
        "::",
        stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mem_space_id) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_addr_st),
        "::",
        stringify!(mem_space_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr_space_id) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_addr_st),
        "::",
        stringify!(addr_space_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr_space_type) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_addr_st),
        "::",
        stringify!(addr_space_type)
        )
    );
}
/// \brief Structure type containing information about a memory space.
///
///This structure type contains information about a memory space. of a target core. A memory space defines
///a region of memory used in different processor architectures, e.g. "program" and "data" memory of a
///Harvard architecture or "P"/"X"/"Y"/"Z" of a DSP architecture.
///
///Users must note that the sematics used in order to access a cache memory are the same as for accessing
///regular memory. On the target side, each cache memory implementation must be provided as a different
///memory space with a unique memory space ID. All accesses to such a memory space must be understood by
///the target as debug access to the cache.
///
///A detailed description for a few member fields of \ref mcd_memspace_st is provided below:
///- \c bits_per_mau    : The minimum addressable unit of a memory is defined as the size in bits of its
///basic block that may have a unique address. For example for a byte addressable
///memory this value would be set to '8' according to the 8 bits of a byte block.
///- \c invariance      : The total number of bytes in a memory word, which is \c bits_per_mau divided
///by 8, consists of groups of "invariant" bytes. These groups can be arranged in
///Big Endian or Little Endian order. For example an \c invariance of '2' and '64'
///\c bits_per_mau, a Little Endian word are represented as b0 b1 b2 b3 b4 b5 b6 b7.
///In contrast to this, a Big Endian word is represented as b6 b7 b4 b5 b2 b3 b0 b1.
///- \c num_mem_blocks  : Each memory space may have a certain number of memory blocks. Memory blocks contain
///additional information pertaining to the intended purpose of the memory. This
///information may be used as a hint for memory data representation within a tool's
///memory view. This field specifies the number of memory blocks present in this
///memory space.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_memspace_st {
    ///< ID of this memory space, ID 0 is reserved.
    pub mem_space_id: u32,
    ///< Unique name of the memory space.
    pub mem_space_name: [mcd_char_t; 32usize],
    ///< Type of the memory space.
    pub mem_type: mcd_mem_type_et,
    ///< Bits per minimum addressable unit (MAU).
    pub bits_per_mau: u32,
    ///< Number of invariant bytes.
    pub invariance: u8,
    ///< Endianness of this memory space. Can be overriden by \c endian
    ///of a \ref mcd_memblock_st.
    pub endian: mcd_endian_et,
    ///< Minimum address of this memory space.
    pub min_addr: u64,
    ///< Maximum address of this memory space.
    pub max_addr: u64,
    ///< Number of memory blocks in this memory space.
    pub num_mem_blocks: u32,
    ///< Supported memory access options (OR'ed bitmask). Can be overriden
    ///by \c supported_access_options of a \c mcd_memblock_st.
    pub supported_access_options: mcd_tx_access_opt_et,
    ///< Mask of core modes for which read accesses are impossible.
    ///A set bit indicates that read accesses are denied in this mode.
    ///Bit 0 represents core mode '1', bit 31 represents core mode '32'.
    ///Can be overriden by \c core_mode_mask_read of a \ref mcd_memblock_st.
    pub core_mode_mask_read: u32,
    ///< Mask of core modes for which write accesses are impossible;
    ///a set bit indicates that write accesses are denied in this mode.
    ///Bit 0 represents core mode '1', bit 31 represents core mode '32'.
    ///Can be overriden by \c core_mode_mask_write of a \ref mcd_memblock_st.
    pub core_mode_mask_write: u32,
}
#[test]
fn bindgen_test_layout_mcd_memspace_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_memspace_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_memspace_st>(),
        88usize,
        concat!("Size of: ", stringify!(mcd_memspace_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_memspace_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_memspace_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mem_space_id) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memspace_st),
        "::",
        stringify!(mem_space_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mem_space_name) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memspace_st),
        "::",
        stringify!(mem_space_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mem_type) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memspace_st),
        "::",
        stringify!(mem_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bits_per_mau) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memspace_st),
        "::",
        stringify!(bits_per_mau)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).invariance) as usize - ptr as usize },
        44usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memspace_st),
        "::",
        stringify!(invariance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).endian) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memspace_st),
        "::",
        stringify!(endian)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_addr) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memspace_st),
        "::",
        stringify!(min_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_addr) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memspace_st),
        "::",
        stringify!(max_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_mem_blocks) as usize - ptr as usize },
        72usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memspace_st),
        "::",
        stringify!(num_mem_blocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).supported_access_options) as usize - ptr as usize },
        76usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memspace_st),
        "::",
        stringify!(supported_access_options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core_mode_mask_read) as usize - ptr as usize },
        80usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memspace_st),
        "::",
        stringify!(core_mode_mask_read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core_mode_mask_write) as usize - ptr as usize },
        84usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memspace_st),
        "::",
        stringify!(core_mode_mask_write)
        )
    );
}
/// \brief Structure type containing information about a memory block.
///
///This structure type contains information about a memory block. A memory block is defined as
///a continuous range of memory addresses with same properties. A memory block is owned by a
///memory space.
///
///Detailed description for a few member fields of \ref mcd_memblock_st is provided below:
///- \c parent_id          : Memory blocks by definition can be hierarchical. This field describes
///the ID of the parent memory block. In case this memory block is at
///root level (and therefore has no parent) the \c parent_id field has
///to be set to \c MCD_MEM_BLOCK_NOPARENT.
///- \c supported_au_sizes : This array has a maximum of \c MCD_MEM_AUSIZE_NUM entries. Each entry
///different from '0' indicates the permissible size of an addressable
///memory unit in bits. All entries represent an allowed multiple of the
///\c bits_per_mau field in the corresponding \c mcd_memspace_st data
///structure. For example, the supported addressable unit sizes for a
///memory block in a memory space with '32' \c bits_per_mau would be
///{32, 64, 96, 128}. This array field would then contain the values
///{1, 2, 3, 4}.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_memblock_st {
    ///< ID of this memory block, ID 0 is reserved.
    pub mem_block_id: u32,
    ///< Memory block name.
    pub mem_block_name: [mcd_char_t; 32usize],
    ///< Indicating that this block has children.
    pub has_children: mcd_bool_t,
    ///< ID of this block's parent (\c MCD_MEM_BLOCK_NOPARENT
    ///if no parent exists).
    pub parent_id: u32,
    ///< Start address of this block.
    pub start_addr: u64,
    ///< End address of this block.
    pub end_addr: u64,
    ///< Endianness of this memory block. Overrides \c endian of the
    ///corresponding \ref mcd_memspace_st.
    pub endian: mcd_endian_et,
    ///< Array of supported addressable unit sizes
    pub supported_au_sizes: [u32; 8usize],
    ///< Supported memory access options (OR'ed bitmask).
    ///Overrides \c supported_access_options of the
    ///corresponding \ref mcd_memspace_st.
    pub supported_access_options: mcd_tx_access_opt_et,
    ///< Mask of core modes for which read accesses are impossible.
    ///A set bit indicates that read accesses are denied in this
    ///mode. Bit 0 represents core mode '1', bit 31 represents
    ///core mode '32'. Overrides \c core_mode_mask_read of the
    ///corresponding \ref mcd_memspace_st.
    pub core_mode_mask_read: u32,
    ///< Mask of core modes for which write accesses are impossible.
    ///A set bit indicates that write accesses are denied in this
    ///mode. Bit 0 represents core mode '1', bit 31 represents
    ///core mode '32'. Overrides \c core_mode_mask_write of the
    ///corresponding \ref mcd_memspace_st.
    pub core_mode_mask_write: u32,
}
#[test]
fn bindgen_test_layout_mcd_memblock_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_memblock_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_memblock_st>(),
        112usize,
        concat!("Size of: ", stringify!(mcd_memblock_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_memblock_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_memblock_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mem_block_id) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memblock_st),
        "::",
        stringify!(mem_block_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mem_block_name) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memblock_st),
        "::",
        stringify!(mem_block_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_children) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memblock_st),
        "::",
        stringify!(has_children)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent_id) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memblock_st),
        "::",
        stringify!(parent_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_addr) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memblock_st),
        "::",
        stringify!(start_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_addr) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memblock_st),
        "::",
        stringify!(end_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).endian) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memblock_st),
        "::",
        stringify!(endian)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).supported_au_sizes) as usize - ptr as usize },
        68usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memblock_st),
        "::",
        stringify!(supported_au_sizes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).supported_access_options) as usize - ptr as usize },
        100usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memblock_st),
        "::",
        stringify!(supported_access_options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core_mode_mask_read) as usize - ptr as usize },
        104usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memblock_st),
        "::",
        stringify!(core_mode_mask_read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core_mode_mask_write) as usize - ptr as usize },
        108usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_memblock_st),
        "::",
        stringify!(core_mode_mask_write)
        )
    );
}
/// \brief Structure type containing register group information.
///
///This structure type contains the properties of a register group of a target core.
///
///Detailed description for a few member fields of \ref mcd_register_group_st is provided below:
///- \c reg_group_id   : Contains the ID of this register group. A register group ID must be
///unique within the scope of a target core. ID '0' is reserved.
///- \c reg_group_name : The name of a register group. A register group name cannot be longer
///than \c MCD_REGNAME_LEN characters (use representative names).
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_register_group_st {
    ///< ID of the register group, ID 0 is reserved.
    pub reg_group_id: u32,
    ///< Register group name.
    pub reg_group_name: [mcd_char_t; 32usize],
    ///< Number of registers part of this group.
    pub n_registers: u32,
}
#[test]
fn bindgen_test_layout_mcd_register_group_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_register_group_st> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_register_group_st>(),
        40usize,
        concat!("Size of: ", stringify!(mcd_register_group_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_register_group_st>(),
        4usize,
        concat!("Alignment of ", stringify!(mcd_register_group_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reg_group_id) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_register_group_st),
        "::",
        stringify!(reg_group_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reg_group_name) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_register_group_st),
        "::",
        stringify!(reg_group_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n_registers) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_register_group_st),
        "::",
        stringify!(n_registers)
        )
    );
}
/// \brief Structure type containing register information for a single register.
///
///This structure contains the properties of a single register of a target core.
///
///Detailed description for a few member fields of \ref mcd_register_group_st is provided below:
///- \c addr         : Address of the register, not memory mapped registers are handled like memory mapped
///into a "register" memory space (with \c mem_type of the corresponding \ref mcd_memspace_st
///set to \c MCD_MEM_SPACE_IS_REGISTERS).
///- \c regname      : The name of a register. A register name cannot be longer than \c MCD_REGNAME_LEN
///characters (use representative names).
///- \c hw_thread_id : The hardware thread ID the register belongs to. The ID must be set to '0'
///if the register is not assigned to a hardware thread.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_register_info_st {
    ///< Either the address of a memory mapped register or the register
    ///address in a dedicated "register memory space".
    pub addr: mcd_addr_st,
    ///< ID of the group this register belongs to.
    pub reg_group_id: u32,
    ///< Register name.
    pub regname: [mcd_char_t; 32usize],
    ///< Register size in bits.
    pub regsize: u32,
    ///< Mask of core modes for which read accesses are impossible.
    ///A set bit indicates that read accesses are denied in this mode.
    ///Bit 0 represents core mode '1', bit 31 represents core mode 32.
    ///Overrides \c core_mode_mask_read of the corresponding \ref mcd_memspace_st.
    pub core_mode_mask_read: u32,
    ///< Mask of core modes for which write accesses are impossible.
    ///A set bit indicates that write accesses are denied in this mode.
    ///Bit 0 represents core mode '1', bit 31 represents core mode '32'.
    ///Overrides \c core_mode_mask_write of the corresponding \ref mcd_memspace_st.
    pub core_mode_mask_write: u32,
    ///< Reading this register can trigger side effects.
    pub has_side_effects_read: mcd_bool_t,
    ///< Writing this register can trigger side effects.
    pub has_side_effects_write: mcd_bool_t,
    ///< Register type (simple, compound or partial).
    pub reg_type: mcd_reg_type_et,
    ///< Hardware thread ID this register belongs to.
    pub hw_thread_id: u32,
}
#[test]
fn bindgen_test_layout_mcd_register_info_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_register_info_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_register_info_st>(),
        88usize,
        concat!("Size of: ", stringify!(mcd_register_info_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_register_info_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_register_info_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_register_info_st),
        "::",
        stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reg_group_id) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_register_info_st),
        "::",
        stringify!(reg_group_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).regname) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_register_info_st),
        "::",
        stringify!(regname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).regsize) as usize - ptr as usize },
        60usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_register_info_st),
        "::",
        stringify!(regsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core_mode_mask_read) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_register_info_st),
        "::",
        stringify!(core_mode_mask_read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core_mode_mask_write) as usize - ptr as usize },
        68usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_register_info_st),
        "::",
        stringify!(core_mode_mask_write)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_side_effects_read) as usize - ptr as usize },
        72usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_register_info_st),
        "::",
        stringify!(has_side_effects_read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_side_effects_write) as usize - ptr as usize },
        76usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_register_info_st),
        "::",
        stringify!(has_side_effects_write)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reg_type) as usize - ptr as usize },
        80usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_register_info_st),
        "::",
        stringify!(reg_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hw_thread_id) as usize - ptr as usize },
        84usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_register_info_st),
        "::",
        stringify!(hw_thread_id)
        )
    );
}
/// \brief Structure type containing information about trigger capabilities.
///
///This structure type contains information about the trigger capabilities of a target.
///
///Note: \c trig_number, \c state_number and \c counter_number should NOT be used to determine
///if the appropriate trigger resource is available. It can just provide hints about the
///maximum number. The availability should be checked evaluating \c action.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_trig_info_st {
    ///< Supported trigger types (OR'ed bitmask).
    pub type_: mcd_trig_type_et,
    ///< Supported trigger options (OR'ed bitmask).
    pub option: mcd_trig_opt_et,
    ///< Supported trigger actions (OR'ed bitmask).
    pub action: mcd_trig_action_et,
    ///< Number of usable triggers (or 0 if number not known).
    pub trig_number: u32,
    ///< Number of states of the trigger set's state machine (or 0 if not known).
    pub state_number: u32,
    ///< Number of usable counters (or 0 if not known).
    pub counter_number: u32,
    ///< True if software breakpoints via code patch are available.
    pub sw_breakpoints: mcd_bool_t,
}
#[test]
fn bindgen_test_layout_mcd_trig_info_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_trig_info_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_trig_info_st>(),
        28usize,
        concat!("Size of: ", stringify!(mcd_trig_info_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_trig_info_st>(),
        4usize,
        concat!("Alignment of ", stringify!(mcd_trig_info_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_info_st),
        "::",
        stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).option) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_info_st),
        "::",
        stringify!(option)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_info_st),
        "::",
        stringify!(action)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trig_number) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_info_st),
        "::",
        stringify!(trig_number)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state_number) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_info_st),
        "::",
        stringify!(state_number)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).counter_number) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_info_st),
        "::",
        stringify!(counter_number)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sw_breakpoints) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_info_st),
        "::",
        stringify!(sw_breakpoints)
        )
    );
}
/// \brief Structure type containing information about a custom trigger.
///
///This structure type contains information about a custom trigger. These custom triggers can be used
///via the \ref mcd_trig_custom_st structure type.
///
///Note: This is NOT related to custom trigger formats - they use a format not defined by the MCD API.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mcd_ctrig_info_st {
    ///< Custom trigger ID, ID 0 is reserved.
    pub ctrig_id: u32,
    ///< Description of the custom trigger.
    pub info_str: [mcd_char_t; 256usize],
}
#[test]
fn bindgen_test_layout_mcd_ctrig_info_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_ctrig_info_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_ctrig_info_st>(),
        260usize,
        concat!("Size of: ", stringify!(mcd_ctrig_info_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_ctrig_info_st>(),
        4usize,
        concat!("Alignment of ", stringify!(mcd_ctrig_info_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctrig_id) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_ctrig_info_st),
        "::",
        stringify!(ctrig_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info_str) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_ctrig_info_st),
        "::",
        stringify!(info_str)
        )
    );
}
impl Default for mcd_ctrig_info_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/// \brief Structure type containing information about a complex core trigger condition.
///
///This structure type contains information about a complex core based trigger of the target system.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_trig_complex_core_st {
    ///< Size of this structure in bytes.
    pub struct_size: u32,
    ///< Trigger type, for this structure type it must be one of:
    ///- \c MCD_TRIG_TYPE_IP
    ///- \c MCD_TRIG_TYPE_READ
    ///- \c MCD_TRIG_TYPE_WRITE
    ///- \c MCD_TRIG_TYPE_RW
    ///- \c MCD_TRIG_TYPE_NOCYCLE
    pub type_: mcd_trig_type_et,
    ///< Adds further qualifiers to the trigger or overrides the behaviour
    ///(multiple options possible).
    pub option: mcd_trig_opt_et,
    ///< Action to be taken on trigger. Only one per trigger allowed.
    pub action: mcd_trig_action_et,
    ///< Parameter for action - depends on the selected action.
    pub action_param: u32,
    ///< Set to "TRUE" on return of \ref mcd_create_trig_f() if trigger was
    ///modified by implementation, untouched otherwise.
    pub modified: mcd_bool_t,
    ///< Set bits indicate that this trigger is inactive when reaching the
    ///corresponding state of the state machine. Bit 0 represents state '1'
    ///of the state machine. Only to be considered if
    ///\c MCD_TRIG_OPT_STATE_IS_CONDITION is set in \c option.
    pub state_mask: u32,
    ///< Start address for the address range the trigger shall be activated for.
    pub addr_start: mcd_addr_st,
    ///< Size of the address range for the trigger (in bytes).
    ///If it is set to '0', the trigger is activated by an access to a single
    ///address.
    ///If it is set to '1', the range of addresses is two (\c addr_start + 1).
    ///The address range can be "inverted" if \c MCD_TRIG_OPT_OUT_OF_RANGE is
    ///set in \c option.
    pub addr_range: u64,
    ///< Data comparison value of the trigger. Only considered if
    ///\c MCD_TRIG_OPT_DATA_IS_CONDITION is set in \c option.
    ///Setting option \c MCD_TRIG_OPT_NOT_DATA activates the trigger
    ///on a data mismatch.
    pub data_start: u64,
    ///< Size of the data value range for the trigger.
    ///If it is set to '0', the trigger is activated on a match with a single
    ///value.
    ///If it is set to '1', the range of values is two (\c data_range + 1).
    ///Option \c MCD_TRIG_OPT_SIGNED_DATA may be set in \c option if the data
    ///shall be interpreted as signed. This usually also requires the option
    ///\c MCD_TRIG_OPT_DATASIZE_IS_CONDITION to be set in \c option.
    pub data_range: u64,
    ///< Only value bits are considered for which the mask is set to '0'.
    pub data_mask: u64,
    ///< Size of the access in bytes. If set to '0' the size shall not be
    ///considered.
    ///Shall be only considered if \c MCD_TRIG_OPT_DATASIZE_IS_CONDITION
    ///is set in \c option.
    pub data_size: u32,
    ///< ID of the hardware thread this trigger is associated with.
    pub hw_thread_id: u32,
    ///< ID of the software thread this trigger is associated with.
    pub sw_thread_id: u64,
    ///< Mask of core modes for which the trigger shall not be activated.
    ///A set bit disables the trigger for the corresponding mode.
    ///Bit 0 represents core mode '1', bit 31 represents core mode '32'.
    pub core_mode_mask: u32,
}
#[test]
fn bindgen_test_layout_mcd_trig_complex_core_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_trig_complex_core_st> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_trig_complex_core_st>(),
        112usize,
        concat!("Size of: ", stringify!(mcd_trig_complex_core_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_trig_complex_core_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_trig_complex_core_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).struct_size) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(struct_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).option) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(option)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(action)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action_param) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(action_param)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modified) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(modified)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state_mask) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(state_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr_start) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(addr_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr_range) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(addr_range)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_start) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(data_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_range) as usize - ptr as usize },
        72usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(data_range)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_mask) as usize - ptr as usize },
        80usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(data_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_size) as usize - ptr as usize },
        88usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(data_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hw_thread_id) as usize - ptr as usize },
        92usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(hw_thread_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sw_thread_id) as usize - ptr as usize },
        96usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(sw_thread_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core_mode_mask) as usize - ptr as usize },
        104usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_complex_core_st),
        "::",
        stringify!(core_mode_mask)
        )
    );
}
/// \brief Structure type containing information about a simple core trigger condition.
///
///This structure type contains information about a simple core based trigger of the target system.
///It is a subset of \ref mcd_trig_complex_core_st.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_trig_simple_core_st {
    ///< Size of this structure in bytes.
    pub struct_size: u32,
    ///< Trigger type, for this structure type it must be one of:
    ///- \c MCD_TRIG_TYPE_IP
    ///- \c MCD_TRIG_TYPE_READ
    ///- \c MCD_TRIG_TYPE_WRITE
    ///- \c MCD_TRIG_TYPE_RW
    ///- \c MCD_TRIG_TYPE_NOCYCLE
    pub type_: mcd_trig_type_et,
    ///< Adds further qualifiers to the trigger or overrides the behaviour
    ///(multiple options possible).
    pub option: mcd_trig_opt_et,
    ///< Action to be taken on trigger. Only one per trigger allowed.
    pub action: mcd_trig_action_et,
    ///< Parameter for action - depends on the selected action.
    pub action_param: u32,
    ///< Set to "TRUE" on return of \ref mcd_create_trig_f() if trigger was
    ///modified by implementation, untouched otherwise.
    pub modified: mcd_bool_t,
    ///< Set bits indicate that this trigger is inactive when reaching the
    ///corresponding state of the state machine. Bit 0 represents state '1'
    ///of the state machine. Only to be considered if
    ///\c MCD_TRIG_OPT_STATE_IS_CONDITION is set in \c option.
    pub state_mask: u32,
    ///< Start address for the address range the trigger shall be activated for.
    pub addr_start: mcd_addr_st,
    ///< Size of the address range for the trigger (in bytes).
    ///If it is set to '0', the trigger is activated by an access to a single
    ///address.
    ///If it is set to '1', the range of addresses is two (\c addr_start + 1).
    ///The address range can be "inverted" if \c MCD_TRIG_OPT_OUT_OF_RANGE is
    ///set in \c option.
    pub addr_range: u64,
}
#[test]
fn bindgen_test_layout_mcd_trig_simple_core_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_trig_simple_core_st> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_trig_simple_core_st>(),
        64usize,
        concat!("Size of: ", stringify!(mcd_trig_simple_core_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_trig_simple_core_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_trig_simple_core_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).struct_size) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_simple_core_st),
        "::",
        stringify!(struct_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_simple_core_st),
        "::",
        stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).option) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_simple_core_st),
        "::",
        stringify!(option)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_simple_core_st),
        "::",
        stringify!(action)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action_param) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_simple_core_st),
        "::",
        stringify!(action_param)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modified) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_simple_core_st),
        "::",
        stringify!(modified)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state_mask) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_simple_core_st),
        "::",
        stringify!(state_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr_start) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_simple_core_st),
        "::",
        stringify!(addr_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr_range) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_simple_core_st),
        "::",
        stringify!(addr_range)
        )
    );
}
/// \brief Structure type containing information about a trigger bus based trigger condition.
///
///Trigger buses exist that can be optionally activated. This structure type contains information
///about a trigger on the target system based on such a trigger bus.
///
///A trigger bus is split into a core local trigger (bits 0 to 15) and a global trigger (bits 16 to 31).
///On real silicon some bits of the trigger bus may also be available on device pins.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_trig_trig_bus_st {
    ///< Size of this structure in bytes.
    pub struct_size: u32,
    ///< Trigger type, for this structure type it must be:
    ///- \c MCD_TRIG_TYPE_TRIG_BUS
    pub type_: mcd_trig_type_et,
    ///< Trigger options, for this structure the following are allowed:
    ///- \c MCD_TRIG_OPT_NOT
    ///- \c MCD_TRIG_OPT_STATE_IS_CONDITION
    pub option: mcd_trig_opt_et,
    ///< Action to be taken on trigger. Only one per trigger allowed.
    pub action: mcd_trig_action_et,
    ///< Parameter for action - depends on the selected action.
    pub action_param: u32,
    ///< Set to "TRUE" on return of \ref mcd_create_trig_f() if trigger was
    ///modified by implementation, untouched otherwise.
    pub modified: mcd_bool_t,
    ///< Set bits indicate that this trigger is inactive when reaching the
    ///corresponding state of the state machine. Bit 0 represents state '1'
    ///of the state machine. Only to be considered if
    ///\c MCD_TRIG_OPT_STATE_IS_CONDITION is set in \c option.
    pub state_mask: u32,
    ///< Trigger bus value.
    pub trig_bus_value: u32,
    ///< Only value bits are considered for which the bitmask is set to '0'.
    pub trig_bus_mask: u32,
}
#[test]
fn bindgen_test_layout_mcd_trig_trig_bus_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_trig_trig_bus_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_trig_trig_bus_st>(),
        36usize,
        concat!("Size of: ", stringify!(mcd_trig_trig_bus_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_trig_trig_bus_st>(),
        4usize,
        concat!("Alignment of ", stringify!(mcd_trig_trig_bus_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).struct_size) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_trig_bus_st),
        "::",
        stringify!(struct_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_trig_bus_st),
        "::",
        stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).option) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_trig_bus_st),
        "::",
        stringify!(option)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_trig_bus_st),
        "::",
        stringify!(action)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action_param) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_trig_bus_st),
        "::",
        stringify!(action_param)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modified) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_trig_bus_st),
        "::",
        stringify!(modified)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state_mask) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_trig_bus_st),
        "::",
        stringify!(state_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trig_bus_value) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_trig_bus_st),
        "::",
        stringify!(trig_bus_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trig_bus_mask) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_trig_bus_st),
        "::",
        stringify!(trig_bus_mask)
        )
    );
}
/// \brief Structure type containing information about a trigger counter on the target.
///
///This structure type contains information about a trigger counter on the target system.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_trig_counter_st {
    ///< Size of this structure in bytes.
    pub struct_size: u32,
    ///< Trigger type, for this structure type it must be:
    ///- \c MCD_TRIG_TYPE_TRIG_COUNTER
    pub type_: mcd_trig_type_et,
    ///< Trigger options, for this structure the following are allowed:
    ///- \c MCD_TRIG_OPT_NOT
    ///- \c MCD_TRIG_OPT_STATE_IS_CONDITION
    pub option: mcd_trig_opt_et,
    ///< Action to be taken on trigger. Only one per trigger allowed.
    pub action: mcd_trig_action_et,
    ///< Parameter for action - depends on the selected action.
    pub action_param: u32,
    ///< Set to "TRUE" on return of \ref mcd_create_trig_f() if trigger was
    ///modified by implementation, untouched otherwise.
    pub modified: mcd_bool_t,
    ///< Set bits indicate that this trigger is inactive when reaching the
    ///corresponding state of the state machine. Bit 0 represents state '1'
    ///of the state machine. Only to be considered if
    ///\c MCD_TRIG_OPT_STATE_IS_CONDITION is set in \c option.
    pub state_mask: u32,
    ///< Current value of counter.
    pub count_value: u64,
    ///< Reload value of counter.
    pub reload_value: u64,
}
#[test]
fn bindgen_test_layout_mcd_trig_counter_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_trig_counter_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_trig_counter_st>(),
        48usize,
        concat!("Size of: ", stringify!(mcd_trig_counter_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_trig_counter_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_trig_counter_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).struct_size) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_counter_st),
        "::",
        stringify!(struct_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_counter_st),
        "::",
        stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).option) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_counter_st),
        "::",
        stringify!(option)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_counter_st),
        "::",
        stringify!(action)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action_param) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_counter_st),
        "::",
        stringify!(action_param)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modified) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_counter_st),
        "::",
        stringify!(modified)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state_mask) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_counter_st),
        "::",
        stringify!(state_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count_value) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_counter_st),
        "::",
        stringify!(count_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reload_value) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_counter_st),
        "::",
        stringify!(reload_value)
        )
    );
}
/// \brief Structure type containing information about a custom trigger on the target.
///
///This structure type contains information about a custom trigger on the target system.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_trig_custom_st {
    ///< Size of this structure in bytes.
    pub struct_size: u32,
    ///< Trigger type, for this structure type it must be:
    ///- \c MCD_TRIG_TYPE_CUSTOM
    pub type_: mcd_trig_type_et,
    ///< Trigger options, for this structure the following are allowed:
    ///- \c MCD_TRIG_OPT_NOT
    ///- \c MCD_TRIG_OPT_STATE_IS_CONDITION
    pub option: mcd_trig_opt_et,
    ///< Action to be taken on trigger. Only one per trigger allowed.
    pub action: mcd_trig_action_et,
    ///< Parameter for action - depends on the selected action.
    pub action_param: u32,
    ///< Set to "TRUE" on return of \ref mcd_create_trig_f() if trigger was
    ///modified by implementation, untouched otherwise.
    pub modified: mcd_bool_t,
    ///< Set bits indicate that this trigger is inactive when reaching the
    ///corresponding state of the state machine. Bit 0 represents state '1'
    ///of the state machine. Only to be considered if
    ///\c MCD_TRIG_OPT_STATE_IS_CONDITION is set in \c option.
    pub state_mask: u32,
    ///< Custom trigger ID.
    pub ctrig_id: u32,
    ///< Custom trigger arguments.
    pub ctrig_args: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_mcd_trig_custom_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_trig_custom_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_trig_custom_st>(),
        48usize,
        concat!("Size of: ", stringify!(mcd_trig_custom_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_trig_custom_st>(),
        4usize,
        concat!("Alignment of ", stringify!(mcd_trig_custom_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).struct_size) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_custom_st),
        "::",
        stringify!(struct_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_custom_st),
        "::",
        stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).option) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_custom_st),
        "::",
        stringify!(option)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_custom_st),
        "::",
        stringify!(action)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action_param) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_custom_st),
        "::",
        stringify!(action_param)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modified) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_custom_st),
        "::",
        stringify!(modified)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state_mask) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_custom_st),
        "::",
        stringify!(state_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctrig_id) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_custom_st),
        "::",
        stringify!(ctrig_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctrig_args) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_custom_st),
        "::",
        stringify!(ctrig_args)
        )
    );
}
/// \brief Structure type containing a trigger state.
///
///This structure type contains the state of a single trigger on the target system.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_trig_state_st {
    ///< Was active at the point of time the trigger set was uploaded.
    pub active: mcd_bool_t,
    ///< Activated at least once after trigger got downloaded to the target.
    pub captured: mcd_bool_t,
    ///< The information in \c captured is valid.
    pub captured_valid: mcd_bool_t,
    ///< Current value of the counter (for counter triggers).
    pub count_value: u64,
    ///< The information in \c count_value is valid.
    pub count_valid: mcd_bool_t,
}
#[test]
fn bindgen_test_layout_mcd_trig_state_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_trig_state_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_trig_state_st>(),
        32usize,
        concat!("Size of: ", stringify!(mcd_trig_state_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_trig_state_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_trig_state_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).active) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_state_st),
        "::",
        stringify!(active)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).captured) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_state_st),
        "::",
        stringify!(captured)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).captured_valid) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_state_st),
        "::",
        stringify!(captured_valid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count_value) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_state_st),
        "::",
        stringify!(count_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count_valid) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_state_st),
        "::",
        stringify!(count_valid)
        )
    );
}
/// \brief Structure type containing a trigger set state.
///
///This structure type contains the state of the trigger set of the target system.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_trig_set_state_st {
    ///< Set if the trigger set is currently active.
    pub active: mcd_bool_t,
    ///< Current state of the trigger set's state machine.
    pub state: u32,
    ///< Current state is valid.
    pub state_valid: mcd_bool_t,
    ///< Current state of trigger bus.
    pub trig_bus: u32,
    ///< Current state of trig_bus is valid.
    pub trig_bus_valid: mcd_bool_t,
    ///< Current state of trace start/stop.
    pub trace: mcd_bool_t,
    ///< Current state is valid.
    pub trace_valid: mcd_bool_t,
    ///< Current state of performance analysis start/stop.
    pub analysis: mcd_bool_t,
    ///< Current state is valid.
    pub analysis_valid: mcd_bool_t,
}
#[test]
fn bindgen_test_layout_mcd_trig_set_state_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_trig_set_state_st> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_trig_set_state_st>(),
        36usize,
        concat!("Size of: ", stringify!(mcd_trig_set_state_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_trig_set_state_st>(),
        4usize,
        concat!("Alignment of ", stringify!(mcd_trig_set_state_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).active) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_set_state_st),
        "::",
        stringify!(active)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_set_state_st),
        "::",
        stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state_valid) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_set_state_st),
        "::",
        stringify!(state_valid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trig_bus) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_set_state_st),
        "::",
        stringify!(trig_bus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trig_bus_valid) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_set_state_st),
        "::",
        stringify!(trig_bus_valid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trace) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_set_state_st),
        "::",
        stringify!(trace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trace_valid) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_set_state_st),
        "::",
        stringify!(trace_valid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).analysis) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_set_state_st),
        "::",
        stringify!(analysis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).analysis_valid) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trig_set_state_st),
        "::",
        stringify!(analysis_valid)
        )
    );
}
/// \brief Structure type containing information about a single transaction.
///
///This structure type contains all information required for a single transaction. The
///transaction itself can be a memory read/write operation or a register read/write operation.
///
///For memory access transactions, the data is stored to the buffer in the target's endianess format.
///For register access transaction, the data is stored to the buffer in Little Endian format. Targets
///need to read/fill the buffer, accordingly.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mcd_tx_st {
    ///< The address of the first memory cell/register.
    pub addr: mcd_addr_st,
    ///< Type of access: Read/Write/Read+Write/Write+Verify.
    pub access_type: mcd_tx_access_type_et,
    ///< Access options: burst, side-effects, alternate path, cache, etc.
    pub options: mcd_tx_access_opt_et,
    ///< Access size in bytes (or 0 if access size does not matter).
    pub access_width: u8,
    ///< The core mode in which the access should be performed (or 0 for
    ///most permissive mode).
    pub core_mode: u8,
    ///< Byte array of size \c num_bytes storing the access data.
    pub data: *mut u8,
    ///< Size of the memory/register access. The buffer \c data needs to
    ///be of this size.
    pub num_bytes: u32,
    ///< Number of successfully received/sent bytes.
    pub num_bytes_ok: u32,
}
#[test]
fn bindgen_test_layout_mcd_tx_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_tx_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_tx_st>(),
        56usize,
        concat!("Size of: ", stringify!(mcd_tx_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_tx_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_tx_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_tx_st),
        "::",
        stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).access_type) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_tx_st),
        "::",
        stringify!(access_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).options) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_tx_st),
        "::",
        stringify!(options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).access_width) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_tx_st),
        "::",
        stringify!(access_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core_mode) as usize - ptr as usize },
        33usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_tx_st),
        "::",
        stringify!(core_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_tx_st),
        "::",
        stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_bytes) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_tx_st),
        "::",
        stringify!(num_bytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_bytes_ok) as usize - ptr as usize },
        52usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_tx_st),
        "::",
        stringify!(num_bytes_ok)
        )
    );
}
impl Default for mcd_tx_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/// \brief Structure type containing a transaction list.
///
///This structure type contains a transaction list.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mcd_txlist_st {
    ///< Array of size \c num_tx storing the transactions.
    pub tx: *mut mcd_tx_st,
    ///< Number of transactions.
    pub num_tx: u32,
    ///< Number of transactions which succeeded without any errors.
    pub num_tx_ok: u32,
}
#[test]
fn bindgen_test_layout_mcd_txlist_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_txlist_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_txlist_st>(),
        16usize,
        concat!("Size of: ", stringify!(mcd_txlist_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_txlist_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_txlist_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_txlist_st),
        "::",
        stringify!(tx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_tx) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_txlist_st),
        "::",
        stringify!(num_tx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_tx_ok) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_txlist_st),
        "::",
        stringify!(num_tx_ok)
        )
    );
}
impl Default for mcd_txlist_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/// \brief Structure type containing the state of a core.
///
///This structure type contains information about the state of a core.
///
///Note that the additional information provided in \c info_str is not a repetition of the
///general core state provided by \c state.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mcd_core_state_st {
    ///< Core state.
    pub state: mcd_core_state_et,
    ///< Core events (OR'ed bitmask)
    pub event: mcd_core_event_et,
    ///< ID of the hardware thread that caused the core to stop.
    pub hw_thread_id: u32,
    ///< ID of the trigger that caused the core to stop.
    pub trig_id: u32,
    ///< Detailed description of a special stop reason.
    pub stop_str: [mcd_char_t; 256usize],
    ///< Detailed description of the core state.
    pub info_str: [mcd_char_t; 256usize],
}
#[test]
fn bindgen_test_layout_mcd_core_state_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_core_state_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_core_state_st>(),
        528usize,
        concat!("Size of: ", stringify!(mcd_core_state_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_core_state_st>(),
        4usize,
        concat!("Alignment of ", stringify!(mcd_core_state_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_state_st),
        "::",
        stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).event) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_state_st),
        "::",
        stringify!(event)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hw_thread_id) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_state_st),
        "::",
        stringify!(hw_thread_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trig_id) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_state_st),
        "::",
        stringify!(trig_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stop_str) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_state_st),
        "::",
        stringify!(stop_str)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info_str) as usize - ptr as usize },
        272usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_core_state_st),
        "::",
        stringify!(info_str)
        )
    );
}
impl Default for mcd_core_state_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/// \brief Structure type containing information about a particular reset class.
///
///This structure type contains information about a particular reset class. Only a single bit of the
///32 bit field \c class_vector can be '1'. It represents the reset class for this particular reset.
///At target system level, there cannot be two objects of type \ref mcd_rst_info_st bound to the same
///reset class.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mcd_rst_info_st {
    ///< Reset class vector which issues this
    ///reset. Exactly one bit may be set.
    pub class_vector: u32,
    ///< Description of the reset class.
    pub info_str: [mcd_char_t; 256usize],
}
#[test]
fn bindgen_test_layout_mcd_rst_info_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_rst_info_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_rst_info_st>(),
        260usize,
        concat!("Size of: ", stringify!(mcd_rst_info_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_rst_info_st>(),
        4usize,
        concat!("Alignment of ", stringify!(mcd_rst_info_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).class_vector) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_rst_info_st),
        "::",
        stringify!(class_vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info_str) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_rst_info_st),
        "::",
        stringify!(info_str)
        )
    );
}
impl Default for mcd_rst_info_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/// \brief Structure type containing information about communication channels.
///
///This structure type contains information about the setup of a communication channel
///and about its properties.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_chl_st {
    ///< Channel ID.
    pub chl_id: u32,
    ///< Type of the requested channel.
    pub type_: mcd_chl_type_et,
    ///< Attributes the requested channel has to provide.
    pub attributes: mcd_chl_attributes_et,
    ///< Maximum message length (e.g. size of the message buffer
    ///as specified by \c msg_buffer_addr)
    pub max_msg_len: u32,
    ///< Address of the message buffer for memory mapped channels.
    pub msg_buffer_addr: mcd_addr_st,
    ///< Channel priority for a prioritized channel.
    ///Range is from 0 (highest priority) to MCD_CHL_LOWEST_PRIO.
    pub prio: u8,
}
#[test]
fn bindgen_test_layout_mcd_chl_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_chl_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_chl_st>(),
        48usize,
        concat!("Size of: ", stringify!(mcd_chl_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_chl_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_chl_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chl_id) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_chl_st),
        "::",
        stringify!(chl_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_chl_st),
        "::",
        stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attributes) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_chl_st),
        "::",
        stringify!(attributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_msg_len) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_chl_st),
        "::",
        stringify!(max_msg_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_buffer_addr) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_chl_st),
        "::",
        stringify!(msg_buffer_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prio) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_chl_st),
        "::",
        stringify!(prio)
        )
    );
}
/// \brief Structure type containing information about a trace.
///
///This structure type contains information about a trace.
///
///A detailed description for a few member fields of \ref mcd_trace_info_st is provided below:
///- \c trace_id            : This ID is used to identify the trace by all trace related functions.
///- \c trace_no_timestamps : Is set if the target has no global "time" concept. It may still provide
///clock cycle information.
///- \c trace_shared        : Is set if the trace buffer used by this trace is shared with other traces.
///- \c trace_size_is_bytes : Is set when the tracebuffer size (in \ref mcd_trace_state_st) is defined in
///bytes instead of frames.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mcd_trace_info_st {
    ///< ID of this trace source, ID 0 is reserved.
    pub trace_id: u32,
    ///< Trace source name.
    pub trace_name: [mcd_char_t; 256usize],
    ///< Type of this trace.
    pub trace_type: mcd_trace_type_et,
    ///< Used trace data format.
    pub trace_format: mcd_trace_format_et,
    ///< Possible modes of this trace (OR'ed bitmask).
    pub trace_modes: mcd_trace_mode_et,
    ///< Target has no real timestamping.
    pub trace_no_timestamps: mcd_bool_t,
    ///< Trace buffer is shared between cores.
    pub trace_shared: mcd_bool_t,
    ///< Trace size is defined in bytes instead of frames.
    pub trace_size_is_bytes: mcd_bool_t,
}
#[test]
fn bindgen_test_layout_mcd_trace_info_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_trace_info_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_trace_info_st>(),
        284usize,
        concat!("Size of: ", stringify!(mcd_trace_info_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_trace_info_st>(),
        4usize,
        concat!("Alignment of ", stringify!(mcd_trace_info_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trace_id) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_info_st),
        "::",
        stringify!(trace_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trace_name) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_info_st),
        "::",
        stringify!(trace_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trace_type) as usize - ptr as usize },
        260usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_info_st),
        "::",
        stringify!(trace_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trace_format) as usize - ptr as usize },
        264usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_info_st),
        "::",
        stringify!(trace_format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trace_modes) as usize - ptr as usize },
        268usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_info_st),
        "::",
        stringify!(trace_modes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trace_no_timestamps) as usize - ptr as usize },
        272usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_info_st),
        "::",
        stringify!(trace_no_timestamps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trace_shared) as usize - ptr as usize },
        276usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_info_st),
        "::",
        stringify!(trace_shared)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trace_size_is_bytes) as usize - ptr as usize },
        280usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_info_st),
        "::",
        stringify!(trace_size_is_bytes)
        )
    );
}
impl Default for mcd_trace_info_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/// \brief Structure type containing the trace state.
///
///This structure type contains information about the trace state.
///
///Note that the additional information provided by \c info_str is no repitition of the
///general trace state provided by \c state.
///
///A detailed description for a few member fields of \ref mcd_trace_state_st is provided below:
///- \c wraparound          : Set if the frame counter has wrapped around (in FIFO mode) or overflowed
///(in PIPE mode).
///- \c count               : Counts frames, but is not reset due to a wraparound if running in FIFO
///mode (serves as progress indicator).
///- \c size                : Maximum size of trace, either in frames or in bytes.
///- \c trigger_delay       : Trigger delay. Input has the same unit as \c size (frames or bytes).
///Output is the actually elapsed number of frames.
///- \c timestamp_accuracy  : Accuracy of timestamping in percent (0 to 100). Higher values indicate
///more accurate timestamps.
///- \c timestamp_is_time   : Set when timestamp is a time value (in picoseconds). Otherwise it
///represents clock cycles.
///- \c modified            : Set on return from \ref mcd_set_trace_state_f when implementation could not
///exactly match requests.
///- \c info_str            : Additional information about the trace (only special state information).
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mcd_trace_state_st {
    ///< Trace state.
    pub state: mcd_trace_state_et,
    ///< Trace buffer mode.
    pub mode: mcd_trace_mode_et,
    ///< Trace's ARM/OFF state follows core run state.
    pub autoarm: mcd_bool_t,
    ///< Set if trace buffer has wrapped around.
    pub wraparound: mcd_bool_t,
    ///< Number of valid trace frames in the buffer.
    pub frames: u64,
    ///< Number of valid trace frames, continues after
    ///wraparound.
    pub count: u64,
    ///< Maximum size of trace (frames or bytes).
    pub size: u64,
    ///< Trigger delay.
    pub trigger_delay: u64,
    ///< Accuracy of timestamping in percent (0 to 100).
    pub timestamp_accuracy: u8,
    ///< Timestamp is in picoseconds.
    pub timestamp_is_time: mcd_bool_t,
    ///< Implementation specific options.
    pub options: u32,
    ///< Settings have been modified by implementation.
    pub modified: mcd_bool_t,
    ///< Optional description of the trace state.
    pub info_str: [mcd_char_t; 256usize],
}
#[test]
fn bindgen_test_layout_mcd_trace_state_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_trace_state_st> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_trace_state_st>(),
        320usize,
        concat!("Size of: ", stringify!(mcd_trace_state_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_trace_state_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_trace_state_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_state_st),
        "::",
        stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_state_st),
        "::",
        stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).autoarm) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_state_st),
        "::",
        stringify!(autoarm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wraparound) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_state_st),
        "::",
        stringify!(wraparound)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frames) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_state_st),
        "::",
        stringify!(frames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_state_st),
        "::",
        stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_state_st),
        "::",
        stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trigger_delay) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_state_st),
        "::",
        stringify!(trigger_delay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp_accuracy) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_state_st),
        "::",
        stringify!(timestamp_accuracy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp_is_time) as usize - ptr as usize },
        52usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_state_st),
        "::",
        stringify!(timestamp_is_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).options) as usize - ptr as usize },
        56usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_state_st),
        "::",
        stringify!(options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modified) as usize - ptr as usize },
        60usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_state_st),
        "::",
        stringify!(modified)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info_str) as usize - ptr as usize },
        64usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_state_st),
        "::",
        stringify!(info_str)
        )
    );
}
impl Default for mcd_trace_state_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/// \brief Structure type containing simple core trace data.
///
///This structure type contains simple trace data of cores and buses.
///
///A detailed description for a few member fields of \ref mcd_trace_data_core_st is provided below:
///- \c data_width            : Data width (in bytes), zero if \c data_mask is used.
///- \c data_mask             : Data bitmask, set bits indicate that the related byte in "data" is valid.
///Zero if \c data_width is used.
///- \c source                : Additional source information (hardware thread ID, bus initiator, etc.).
///- \c aux_info              : Auxiliary information, e.g. endianess, burst information or core execution mode.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_trace_data_core_st {
    ///< Timestamp of this cycle (picoseconds or clock cycles).
    pub timestamp: u64,
    ///< Markers for this cycle.
    pub marker: mcd_trace_marker_et,
    ///< Basic cycle type.
    pub cycle: mcd_trace_cycle_et,
    ///< Address.
    pub addr: mcd_addr_st,
    ///< Data (code length for program flow).
    pub data: u64,
    ///< Width of data (in bytes).
    pub data_width: u8,
    ///< Bitmask for valid bytes in \c data.
    pub data_mask: u8,
    ///< Additional source information.
    pub source: u16,
    ///< Auxiliary information.
    pub aux_info: u32,
}
#[test]
fn bindgen_test_layout_mcd_trace_data_core_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_trace_data_core_st> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_trace_data_core_st>(),
        56usize,
        concat!("Size of: ", stringify!(mcd_trace_data_core_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_trace_data_core_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_trace_data_core_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_core_st),
        "::",
        stringify!(timestamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).marker) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_core_st),
        "::",
        stringify!(marker)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cycle) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_core_st),
        "::",
        stringify!(cycle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_core_st),
        "::",
        stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        40usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_core_st),
        "::",
        stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_width) as usize - ptr as usize },
        48usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_core_st),
        "::",
        stringify!(data_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_mask) as usize - ptr as usize },
        49usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_core_st),
        "::",
        stringify!(data_mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).source) as usize - ptr as usize },
        50usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_core_st),
        "::",
        stringify!(source)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aux_info) as usize - ptr as usize },
        52usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_core_st),
        "::",
        stringify!(aux_info)
        )
    );
}
/// \brief Structure type containing logic analyzer trace data.
///
///This structure type contains "logic analyzer"-like trace data (256 channels).
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_trace_data_event_st {
    ///< Timestamp of this cycle (either picoseconds or clock cycles).
    pub timestamp: u64,
    ///< Markers for this cycle.
    pub marker: mcd_trace_marker_et,
    ///< User data, array of 256 bits. LSB of data[0] represents channel 0.
    pub data: [u32; 8usize],
}
#[test]
fn bindgen_test_layout_mcd_trace_data_event_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_trace_data_event_st> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_trace_data_event_st>(),
        48usize,
        concat!("Size of: ", stringify!(mcd_trace_data_event_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_trace_data_event_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_trace_data_event_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_event_st),
        "::",
        stringify!(timestamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).marker) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_event_st),
        "::",
        stringify!(marker)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_event_st),
        "::",
        stringify!(data)
        )
    );
}
/// \brief Structure type containing statistic counter data.
///
///This structure type contains "logic analyzer"-like trace data (8 channels).
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mcd_trace_data_stat_st {
    ///< Timestamp of this cycle (either picoseconds or clock cycles).
    pub timestamp: u64,
    ///< Markers for this cycle.
    pub marker: mcd_trace_marker_et,
    ///< Array of 8 statistic counters ('-1' represents an invalid value).
    pub count: [u64; 8usize],
}
#[test]
fn bindgen_test_layout_mcd_trace_data_stat_st() {
    const UNINIT: ::std::mem::MaybeUninit<mcd_trace_data_stat_st> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mcd_trace_data_stat_st>(),
        80usize,
        concat!("Size of: ", stringify!(mcd_trace_data_stat_st))
    );
    assert_eq!(
        ::std::mem::align_of::<mcd_trace_data_stat_st>(),
        8usize,
        concat!("Alignment of ", stringify!(mcd_trace_data_stat_st))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_stat_st),
        "::",
        stringify!(timestamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).marker) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_stat_st),
        "::",
        stringify!(marker)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(mcd_trace_data_stat_st),
        "::",
        stringify!(count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __crt_locale_data {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __crt_multibyte_data {
    pub _address: u8,
}
extern crate libloading;
pub struct DynamicMCDxDAS {
    __library: ::libloading::Library,
    pub __va_start: Result<
        unsafe extern "C" fn(arg1: *mut *mut ::std::os::raw::c_char, ...),
        ::libloading::Error,
    >,
    pub __security_init_cookie: Result<unsafe extern "C" fn(), ::libloading::Error>,
    pub __security_check_cookie:
    Result<unsafe extern "C" fn(_StackCookie: usize), ::libloading::Error>,
    pub __report_gsfailure:
    Result<unsafe extern "C" fn(_StackCookie: usize) -> !, ::libloading::Error>,
    pub _invalid_parameter_noinfo: Result<unsafe extern "C" fn(), ::libloading::Error>,
